{
  "Core Identity": {
    "questions": [
      "What’s your full name, and do you know why your parents chose it for you?",
      "How does it feel to be nine years old—what’s the best thing about this age?",
      "When you think about being a boy (or girl), what does that mean to you?",
      "If you could pick three words that describe your personality, which would you choose and why?",
      "Can you tell me about a time you felt really shy (or really energetic)? What was happening?",
      "What is your family’s cultural or ethnic background, and what traditions do you celebrate together?",
      "Are there any foods, songs, or stories from your culture that you love—what makes them special?",
      "Besides English, do you speak or understand any other languages? How do they sound when you say them?",
      "Do you have a favorite animal, color, or object that feels like “you”—what is it and why?",
      "If you had to choose a symbol (like a lion, a red balloon, or a star) to represent yourself, what would it be and what does it mean?",
      "How do you like to introduce yourself to new people—what do you say or do first?",
      "What nicknames do people call you, and how do those nicknames make you feel?",
      "Do you ever wonder how people will describe you—what would you hope they say?",
      "Is there a family story behind your name or a middle name—what’s the story?",
      "How do you think your personality is different from your parents’ or siblings’?",
      "If you had to write a short autobiography about your life so far, what would the title be?",
      "What childhood memory do you think shaped who you are today?",
      "If you could create a crest or coat of arms for yourself, what symbols would be on it and why?",
      "Who do you admire most in your family, and what traits do you share with them?",
      "What do you think makes you unique compared to your classmates?",
      "When you look in the mirror, what do you notice first about yourself—your face, your eyes, your smile?",
      "How would you describe your voice—soft, loud, quick, slow? How does it feel when you speak?",
      "What talents or skills do you feel proud of, and when did you first discover them?",
      "If you had to pick a theme song for your life, what would it be called and why?",
      "What’s one thing people often misunderstand about you, and how would you clarify it?",
      "Have you ever felt proud of a quick decision you made—what was the situation and how did you resolve it?",
      "What does “being brave” mean to you, and can you describe a time you felt brave?",
      "If you could travel back in time to meet a younger version of yourself, what advice would you give?",
      "What fears do you have about growing up, and what makes you feel less afraid?",
      "Do you have any habits or quirks that make you feel like yourself, even if others find them odd?",
      "If someone wrote a poem about you, what images or metaphors would you like them to use?",
      "What’s something you’ve done that surprised everyone, including yourself?",
      "How do you decide who your real friends are—what qualities do you look for?",
      "If you could spend a day as an animal, which one would you choose and why?",
      "When you’re alone, how do you spend your time—drawing, daydreaming, reading?",
      "Is there a special place (in your home or outside) where you feel most like yourself—describe it.",
      "What’s the first thing that comes to mind when you hear the word “home”?",
      "If you could design your own personal flag, what colors and symbols would it have?",
      "What do you think makes someone a good listener, and how do you practice listening?",
      "When you feel excited, what does that look like on your face or in your body language?",
      "What’s one trait you wish you could change about yourself, and why?",
      "Who in your life do you think knows you best, and what makes them understand you so well?",
      "If you were to choose a spirit guide (real or imaginary) to help you grow, who would it be and why?",
      "What’s a secret goal you have for yourself that you haven’t shared with anyone yet?",
      "How do you handle it when someone compliments you—what goes through your mind?",
      "If you could invent a new sense (beyond sight, sound, touch, taste, smell), what would it be and why?",
      "What’s the first thing you remember thinking about when you woke up this morning?",
      "If you had to describe your own sense of humor, what types of jokes or funny moments make you laugh?",
      "When you feel upset, what do you notice first in your thoughts or your body?",
      "If you wrote a letter to your future self ten years from now, what would you say?"
    ],
    "follow_up_questions": [
      "What inspired you to say that?",
      "Why does that matter to you?",
      "How did you feel when that happened?",
      "What memories come up when you think of that?",
      "Which part of that stands out most in your mind?",
      "Can you describe it to me as if I’d never heard of it before?",
      "What do you notice about yourself when you remember that?",
      "If you could relive that moment, would you change anything? Why or why not?",
      "What questions pop into your head about that now?",
      "How would you explain this to one of your friends?",
      "What’s one little detail about this that nobody else knows?",
      "How has that shaped who you are today?",
      "If you had to show someone this with a drawing or gesture, what would it look like?",
      "What sights, sounds, or smells do you imagine when you think about it?",
      "What surprised you most about that experience?",
      "What lesson, if any, did you learn from it?",
      "How do you think this will matter to you in a year or ten years?",
      "What would you tell someone who’s never experienced that?",
      "What do you think other people feel about that?",
      "Is there anything else you’d like to add that I didn’t ask?"
    ]
  },
  "Living Environment": {
    "questions": [
      "Can you describe the country and region (state/province) where you live—what makes it special or different from other places?",
      "How would you explain your city, town, or village to someone who’s never been there—what sights or activities stand out?",
      "What type of home do you live in (house, apartment, mobile home, etc.), and what do you like most about it?",
      "Tell me about your bedroom and play area—what colors, decorations, or toys make it feel like yours?",
      "What’s the outdoor space around your home like (garden, backyard, nearby playground), and what do you enjoy doing there?",
      "Who are some of your neighbors—kids, pets, or grown-ups—and what games or adventures have you shared with them?",
      "What key landmarks (like a park, store, or school) are near your home, and why are they important or fun for you?",
      "When you step outside, what sounds or smells do you notice first—are there any you love or dislike?",
      "Can you share a memorable story about something you did in your neighborhood, like an adventure in the park or visiting a local shop?",
      "If you were giving someone a tour of your neighborhood, where would you start and what would you definitely show them first?",
      "What do the streets around your home look like—are they busy or quiet, lined with trees or buildings?",
      "How do you get from your home to school—do you walk, bike, take a bus, or ride in a car? What do you see along the way?",
      "What is the weather like most days where you live—sunny, rainy, snowy, windy? How does it affect what you do outside?",
      "Do you have any favorite spots in your neighborhood for collecting leaves, rocks, or other treasures? Where and why?",
      "What does your front door look like—its color, design, any decorations? Does it feel welcoming to you?",
      "Tell me about your kitchen and dining area—what smells or sounds do you hear when someone is cooking?",
      "Is there a special window or vantage point where you like to watch the world outside—what do you see from there?",
      "What kind of flooring do you have at home—carpet, wood, tile? How does it feel under your feet?",
      "Do you have any indoor plants, pets, or aquariums in your home? How do you help take care of them?",
      "What appliances or gadgets do you use most often at home—like a microwave, refrigerator, or video game console—and why?",
      "How do you decorate for different seasons or holidays—like Halloween, Christmas, Chinese New Year? What decorations do you put up?",
      "What is your family’s routine for keeping the house clean—who does what chores and when?",
      "Do you have a favorite place to read or draw at home—like a cozy corner or a sunny windowsill? Describe it.",
      "How do you feel when the power goes out or there’s a storm—what do you do to stay safe or entertained?",
      "What does your closet look like—how are your clothes organized, and do you have any favorite items you keep there?",
      "Is there a shoe rack or a place for jackets by the door—how do you keep your outdoor gear tidy?",
      "What kind of furniture do you have in your living room—sofa, chairs, coffee table—and which piece is your favorite?",
      "Do you have any artwork, posters, or photographs on the walls? Whose pictures or what images do you like to look at?",
      "How do you keep your toys organized—do you have bins, shelves, or a toy chest? Which toys are easiest to find?",
      "What does the bathroom smell like, and what items do you see on the sink or in the shower?",
      "Do you have any special seat or table where you do homework—describe it and why it helps you focus?",
      "What does your street look like at night—are there streetlights, quiet houses, or busy traffic?",
      "Is there a nearby creek, river, or pond where you sometimes visit? What do you like about that water spot?",
      "What kinds of trees, flowers, or bushes grow around your home—do you watch them change through the seasons?",
      "What sounds do you hear early in the morning—birds, distant traffic, neighbors talking? How does it wake you up?",
      "Is there a bakery, ice cream shop, or café you can walk to in your neighborhood? What do you like to get there?",
      "What is the view from your bedroom window—houses, fields, playgrounds, or something else?",
      "Do you have any outdoor toys or equipment—like a trampoline, swing set, or sandbox—what games do you play there?",
      "How do you feel when you leave home on a trip—what emotions or thoughts go through your mind as you close the door behind you?",
      "What is the closest grocery store or market? Describe the walk or drive there and what you see along the way.",
      "Do you ever go for evening walks—what does your neighborhood look like after sunset?",
      "If you could change one thing about your home or neighborhood, what would it be and why?",
      "Have you ever helped your family with gardening or planting—remember a time you dug in the dirt and planted seeds?",
      "What do you do if you see trash or litter on the street—do you pick it up yourself, or call an adult?",
      "How do you and your family keep warm in winter—electric heater, wood stove, or thick blankets? Describe your cozy routine.",
      "What’s the most surprising thing you’ve found around your house—maybe a forgotten toy or a hidden drawer?",
      "Describe a time when you went on a bus, train, or subway for the first time—what was the journey like?",
      "Do you ever visit rooftops, balconies, or terraces—what do you see from high up above your house?",
      "What kind of sounds do you hear when you fall asleep—traffic, crickets, a lullaby from your parents?",
      "How do you and your family organize recycling or composting—where do you put paper, plastic, or food scraps?",
      "If you had to draw a treasure map of your neighborhood, which secret paths or landmarks would you include?",
      "Do you ever help with home repairs—like hammering a nail or painting a wall? Describe a recent project you enjoyed.",
      "What is the rooftop or attic like at your home—have you ever climbed up there, and what did you find?",
      "How does your family celebrate a rainy day at home—board games, hot cocoa, or watching movies together?",
      "What do you think is the best time of day to be outside in your neighborhood—sunrise, midday, evening? Why?",
      "When you look at a map of your area, what symbols or labels grab your attention the most?"
    ],
    "follow_up_questions": [
      "What part of that place or detail makes you the happiest?",
      "When you picture it in your mind, what colors do you see?",
      "What do your friends or family say about it?",
      "How long does it take you to get there, and what do you notice along the way?",
      "Can you share a story that happened there?",
      "If that spot had its own soundtrack, what sounds or music would you hear?",
      "Which season (spring, summer, fall, winter) is your favorite there, and why?",
      "What would you miss most about it if you couldn’t visit anymore?",
      "If you could bring one special thing from home to that place, what would it be?",
      "Are there any unspoken rules or customs you follow when you’re there?",
      "If you had to draw a map of the area, which landmarks would you include?",
      "What’s something new you noticed the last time you were there?",
      "What’s the biggest challenge you face when you’re in that space?",
      "What time of day do you like being there best, and what makes it special?",
      "If this place could do one magical thing, what would it be?",
      "Who would you invite to join you there, and what would you do together?",
      "In a single sentence, how would you sum up that place?",
      "If that place or object had a voice, what would it say to you?",
      "What do you think someone who’s never been there would be surprised to learn?",
      "Is there anything else you’d like me to know about it?"
    ]
  },
  "Family & Close Relationships": {
    "questions": [
      "Who do you live with at home, and what are their names and jobs?",
      "Can you tell me about your brothers or sisters—how old are they and what’s it like when you play or argue together?",
      "Do you have any grandparents, cousins, or other family who visit or live nearby? What’s your favorite thing to do with them?",
      "What happens at mealtimes in your family—who cooks, where do you eat, and what do you talk about?",
      "How do you celebrate special days like birthdays or holidays—what traditions make those times memorable?",
      "What chores or responsibilities do you help with around the house, and how do you feel about doing them?",
      "How do your parents or guardians show they love you—through hugs, words, or other ways?",
      "If you do something wrong, how do your parents or guardians let you know, and what do they do next?",
      "When you feel sad, scared, or upset, who do you go to first, and what do they do to help you feel better?",
      "Can you share a story about a time your family came together to solve a problem or celebrate something important?",
      "What time of day does your family usually eat dinner, and what’s the mood like around the table?",
      "Who usually decides what’s for dinner, and do you ever help plan the menu?",
      "Do you ever share a special meal with extended family—describe a recent time you all got together to eat.",
      "What is your favorite family recipe, and who taught you how to make it?",
      "How do you and your siblings settle disagreements—do you talk it out, take turns, or something else?",
      "Is there a bedtime ritual in your household—like reading a story or saying prayers—what do you do before you fall asleep?",
      "What does a typical weekend look like for your family—do you go out, stay in, or follow any routines?",
      "Do you have family game nights or movie nights—what games or movies do you enjoy together?",
      "When someone in your family is upset, how do others try to comfort them—who takes the lead in offering support?",
      "If you had to describe your family in three words, what would they be and why?",
      "Do you have any nicknames given by family members—how did you get them, and do you like them?",
      "What languages or dialects are spoken at home, and who taught you each one?",
      "Do you have a pet that’s part of the family—how do you and your family care for it, and what role does it play?",
      "What’s the funniest or silliest memory you have with your siblings or cousins?",
      "How do you share chores—who does dishes, vacuuming, or taking out the trash, and how do you feel about it?",
      "Has your family ever moved to a new house or city—describe how everyone felt and what helped you settle in.",
      "What’s a family tradition that takes place every morning, like saying goodbye before school or having breakfast together?",
      "How do you handle family rules—bedtime, screen time, or homework—and do you ever negotiate exceptions?",
      "When you have a big achievement at school, how does your family celebrate or recognize it?",
      "What’s a challenging moment your family faced (illness, job change, etc.) and how did you all support each other?",
      "If you could add a new family tradition—like monthly outings or crafts—what would it be and why?",
      "How do you keep in touch with relatives who live far away—phone calls, video chats, letters—and how often do you connect?",
      "Do you have any family heirlooms or keepsakes—what are they, and what do they mean to you?",
      "What role does music, singing, or dancing play in your family gatherings—does anyone lead the entertainment?",
      "When holidays arrive, who decorates the house, and how do you all work together to get ready?",
      "What is the most memorable vacation or trip you’ve taken with your family—where did you go and what did you do?",
      "Do you ever cook or bake with a family member—describe a time when you collaborated in the kitchen?",
      "How do you organize car rides or trips—who sits in the front, who picks the music, and what do you chat about?",
      "If you had an argument with a family member, what was it about and how did you reach a resolution?",
      "How do family members show appreciation—do they say thank you, give hugs, or write notes to each other?",
      "What chores do you consider the most fun or the most boring, and how do you make them better for yourself?",
      "Who in your family tells the best stories, and can you recount a favorite tale they’ve shared with you?",
      "Do you have a family “code word” or secret phrase—what is it, and when do you use it?",
      "How is birthday cake handled in your family—who bakes it, who cuts it, and how do you share messages on it?",
      "What’s a memorable lesson you learned from a grandparent or older relative—how did they teach it to you?",
      "What’s the first thing you do when you arrive home—say hello, drop your backpack, or check on someone?",
      "How do you mark family milestones like new jobs, graduations, or anniversaries—do you have parties or small gifts?",
      "What’s a time you felt most proud of a sibling or cousin—what did they do and how did you celebrate them?",
      "Do you have any family inside jokes—what are they, and how did they start?",
      "When you go to bed, what time do lights go off and who usually tucks you in or says goodnight?",
      "If you had to choose one family member to spend a whole day with, who would it be and what would you do together?",
      "What’s a family pet’s funniest habit—something that always makes everyone laugh when the pet does it?"
    ],
    "follow_up_questions": [
      "What made you say that?",
      "How did that moment make you feel?",
      "Why is that important to you?",
      "Can you give me a specific example of when that happened?",
      "What do you notice most about how others react in that situation?",
      "How has that changed over time?",
      "What’s one detail about that you haven’t told me yet?",
      "If you could change anything about that, what would you do differently?",
      "How do you think someone else in your family would describe the same event?",
      "What’s the hardest part about that for you?",
      "What do you enjoy most about it?",
      "Who usually takes the lead, and why?",
      "How do you prepare for that activity or routine?",
      "What smells, sounds, or sights do you associate with it?",
      "How would you explain that to a friend who’s never experienced it?",
      "What lesson, if any, did you learn from it?",
      "How do you think it shapes who you are today?",
      "If you were writing it as a story, how would you start?",
      "When you look back in a year, what do you think you’ll remember most?",
      "Is there anything else about that you’d like to share?"
    ]
  },
  "Education & Learning": {
    "questions": [
      "What grade are you in, and what kind of school do you go to (public, private, homeschool, etc.)?",
      "How do you feel about your grade level—what’s exciting or tricky about being in your grade?",
      "Who is your favorite teacher, and what makes their class stand out?",
      "Can you tell me about a classmate you really enjoy working or playing with?",
      "What’s your daily commute like—how do you get to school, and what do you see or do along the way?",
      "What does a typical school day schedule look like for you from the first bell to the last?",
      "Which subject do you find easiest, and why does it come naturally to you?",
      "Which subject feels hardest, and what do you do when it gets challenging?",
      "How do you learn best—do you like seeing pictures, doing hands-on activities, listening to explanations, or something else?",
      "Do you participate in any clubs or lessons after school (like chess club, music lessons, or martial arts)? What do you enjoy about them?",
      "What’s a project or assignment you’ve done recently that made you proud—describe how you worked on it and what you learned.",
      "How do you prepare for tests or quizzes—do you make flashcards, study with friends, or ask your teacher for help?",
      "What does your backpack look like—what books, supplies, or gadgets do you carry every day?",
      "Do you have a favorite spot in the classroom—like a desk by the window or a cozy corner where you like to sit? Why?",
      "How do you handle group work—do you prefer to lead, follow instructions, or divide tasks evenly with classmates?",
      "Have you ever given a presentation or spoken in front of the class—how did you feel before and after?",
      "What’s your school lunch like—what do you pack or buy, and who do you sit with at lunchtime?",
      "Do you ever get extra help from a tutor or older student—how do they help you understand difficult topics?",
      "What’s a funny or embarrassing moment you remember from school—how did you and your classmates react?",
      "How do you keep track of homework assignments—do you use a planner, phone reminders, or sticky notes?",
      "What technology do you use at school—like tablets, laptops, or interactive whiteboards—and how does it help you learn?",
      "Is there a school rule you think is especially important—like no running in the hallways, raising your hand to speak, or wearing a uniform?",
      "Have you ever run for a class representative or student council position—what motivated you, and what was the outcome?",
      "What’s the most interesting field trip you’ve been on—where did you go and what did you discover?",
      "How do you feel on the first day of school—nervous, excited, curious? What are your first thoughts when you arrive?",
      "What’s your favorite classroom activity—science experiments, art projects, reading circles, or something else?",
      "Do you ever teach younger students—like reading to kindergarteners or helping in a lower-grade class? What was that like?",
      "What’s the biggest challenge you’ve faced in school this year, and how did you work through it?",
      "Do you have a study buddy or best friend at school—how do you help each other with schoolwork?",
      "What’s your routine for completing long-term projects—planning, research, drafting, revising, or presenting?",
      "Have you ever skipped a day of school—why did you stay home, and what did you do instead?",
      "What’s your favorite book assigned by school—what did you like most about the story or characters?",
      "How do you balance screen time for schoolwork versus screen time for fun after school?",
      "What science experiment or demonstration did you enjoy the most—describe what you observed and what you learned.",
      "What’s one thing you wish your school would teach that it doesn’t—like cooking, coding, or a new language?",
      "How do you feel when you finish a big assignment—relieved, proud, or ready to celebrate?",
      "Have you ever helped a classmate who was struggling—how did you explain the concept or solve the problem together?",
      "Do you use any educational apps or websites at home—like Khan Academy, Duolingo, or Scratch? How do they help you learn?",
      "What’s your favorite art medium in school—painting, sculpting, drawing—and what have you created recently?",
      "How do you handle distractions in class—like noise, daydreaming, or friends talking? What helps you focus?",
      "What’s a creative way you’ve decorated your locker or desk—stickers, photos, or drawings—to make it feel like yours?",
      "Have you ever written a story or poem for school—what was it about, and how did your teacher respond?",
      "What’s a math problem or concept you recently mastered—how did you figure it out step by step?",
      "Do you have a mentor or role model at school—like a favorite teacher or coach—who inspires you? How do they help?",
      "What extracurricular clubs or sports do you wish your school offered, and why would you join them?",
      "When you get feedback on your assignments, how do you use it to improve—do you revise, ask questions, or take notes?",
      "What’s the best thing about your school’s library—quiet space, interesting books, or helpful librarians?",
      "Have you ever participated in a school play, talent show, or musical performance—what role did you play and what was the experience like?",
      "How do you keep your school supplies organized—pencils, notebooks, calculators—so you can find them quickly?",
      "What’s the most valuable lesson you’ve learned from a teacher—beyond academics, like responsibility, empathy, or time management?",
      "How do you feel about homework in general—too much, too little, or just right? What would you change if you could?",
      "What’s one goal you have for your learning this term—improving handwriting, reading faster, or mastering a new skill?"
    ],
    "follow_up_questions": [
      "What made you say that?",
      "Can you give me an example of when that happened?",
      "How did you feel in that moment?",
      "Why is that important to you?",
      "What’s the most fun or the hardest part about it?",
      "How has that changed since you first started?",
      "What do others say about it—friends, teachers, or family?",
      "If you could do it again, what would you do differently?",
      "What sounds, sights, or smells do you remember around that time?",
      "How do you prepare for that day or activity?",
      "What’s one thing nobody else knows about that experience?",       
      "Which part stands out most in your mind?",       
      "How would you explain it to someone who’s never been there?",       
      "What would you tell a friend to help them get better at it?",       
      "What surprised you most about that?",       
      "What lesson did you learn from it?",       
      "How do you think it will matter to you next year?",       
      "If that subject or activity were a person, what would they be like?",       
      "What advice would you give to a younger kid about this?",       
      "Is there anything else you’d like to add that I didn't ask?"     
    ]
  },
  "Play & Recreation": {
    "questions": [
      "What’s your favorite toy to play with, and what makes it special to you?",
      "Which video game or app do you love the most, and what do you enjoy about it?",
      "If you could invent a brand-new game or toy, what would it be and how would you play with it?",
      "What sport or physical activity do you like to do the most, and why?",
      "Tell me about a time you played on a team or in a class (soccer, gymnastics, etc.)—what was that experience like?",
      "When you go outside to play freely (bike riding, tag, etc.), what’s your favorite thing to do?",
      "What’s the coolest drawing, painting, or craft you’ve made recently?",
      "Have you ever built something awesome with LEGO, blocks, or another engineering kit? What did you build?",
      "What’s your favorite pretend-play scenario or costume to dress up in, and what role do you play?",
      "If you could spend an entire day doing any play or creative activity, what would your perfect play day look like?",
      "What board game do you enjoy the most, and what strategies or tricks do you use to win?",
      "Have you ever tried making your own board game or card game—what rules did you create?",
      "What’s a playground game you loved as a younger child—like hopscotch or Red Rover—and why did you like it?",
      "Which outdoor game makes you feel the most adventurous—hide-and-seek, capture the flag, or something else?",
      "What’s your favorite building material—wooden blocks, magnetic tiles, or cardboard boxes—and what did you make with it?",
      "Describe a time you organized a game or activity for your friends—how did you decide on the rules?",
      "What’s your favorite puzzle (jigsaw, Sudoku, Rubik’s Cube), and what do you enjoy about solving it?",
      "Have you ever designed a scavenger hunt—what clues did you use and where did you hide the items?",
      "What’s a card game or tabletop game you learned from family or friends—how do you play it?",
      "Which outdoor adventure activity have you tried—like hiking, rock climbing, or kayaking—and how did it feel?",
      "What’s a video game challenge or boss battle that you overcame—how did you figure out the solution?",
      "What’s your favorite app for drawing or digital art, and what kinds of pictures do you create with it?",
      "Have you ever participated in a neighborhood sports league or community tournament—what was that experience like?",
      "What’s a craft or project you made for a gift—describe how you chose materials and decorated it?",
      "What’s your favorite ride or attraction at an amusement park, and what memories do you have from riding it?",
      "Have you ever put on a puppet show or shadow play—what story did you tell and who watched it?",
      "What’s a musical instrument you’ve tried to play—guitar, keyboard, drums—and what did you learn?",
      "If you could host a playdate for all your friends, what activities or games would you plan?",
      "Have you ever joined a nature club or went on a bug-hunting expedition—what insects or plants did you discover?",
      "What’s a science kit experiment you conducted at home—describe your setup, procedure, and findings?",
      "What’s your favorite crafting material—yarn, clay, fabric—and what have you made with it?",
      "If you could build a treehouse or a fort, what features would you include to make it awesome?",
      "Have you ever participated in a dance class or performance—what style of dance was it and how did you practice?",
      "What’s a comedy or funny skit you’ve performed for friends or family—what was the punchline?",
      "If you could invent a new sport, what would the rules be and what equipment would players use?",
      "What’s a Lego competition or building challenge you took part in—what did your entry look like?",
      "Have you ever created a stop-motion video or animation with toys—what story did you animate?",
      "Which playground structure (slides, swings, climbing frame) do you enjoy the most, and why?",
      "What’s a scavenger hunt clue you remember creating or solving—what was the hardest clue?",
      "Have you ever tried geocaching or treasure hunting with GPS—what did you find?",
      "What’s a karaoke song you love to sing, and who do you sing it with?",
      "If you could design your own skateboard or bicycle, what colors and patterns would you choose?",
      "What’s the funniest prank or joke you’ve played on someone—how did they react?",
      "Have you ever taken a martial arts, fencing, or self-defense class—what did you learn about discipline?",
      "What’s a creative way you’ve recycled or repurposed old toys or materials into something new?",
      "If you could build a robot to help you play, what tasks would you want it to do?",
      "What’s a virtual reality game or experience you tried—how did it feel to be immersed in a digital world?",
      "Have you ever entered a talent show—what talent did you showcase and how did the audience respond?",
      "What’s a sandcastle, snowman, or mud sculpture you built—what tools or decorations did you use?",
      "If you could teach a workshop on any craft or game, what would you teach and why?",
      "What’s a building project (birdhouse, garden box, model airplane) you constructed with a grown-up’s help?",
      "Have you ever hosted a sleepover—what games, movies, or snacks made it memorable?",
      "What’s the most unusual toy or gadget you own—where did you get it and what makes it unique?"
    ],
    "follow_up_questions": [
      "What made you decide on that?",
      "How did you feel the first time you tried it?",
      "Can you walk me through your best memory with it?",
      "What’s the trickiest or most challenging part?",
      "How do your friends or family react when you play or create this?",
      "What sounds, sights, or textures do you notice when you’re doing it?",
      "If this toy or game could talk, what would it say to you?",
      "How would you describe it to someone who’s never seen or played it?",
      "What would you change to make it even more fun?",
      "What skills or muscles do you use when you play or build this?",
      "Who do you most like playing or creating with, and why?",
      "If you had to teach someone else how to do it, what steps would you show them?",
      "What’s one secret tip or strategy you use?",
      "What surprised you the most when you first did it?",
      "How has your approach or style changed over time?",
      "What’s one challenge you’ve overcome while playing or building it?",
      "What advice would you give to a younger kid trying this for the first time?",
      "If you could combine this with another game or craft, what would you mix together?",
      "How do you know when you’ve done it really well?",
      "Is there anything else about this that you’d like me to know?"
    ]
  },
  "Daily Routines & Habits": {
    "questions": [
      "What time do you usually wake up on school mornings, and what’s the first thing you do?",
      "What’s your go-to breakfast, and how does it make you feel for the rest of the morning?",
      "How do you pack your school bag—what items are absolutely must-haves?",
      "After you get home from school, what’s your favorite snack and where do you eat it?",
      "Can you walk me through your homework routine—where do you sit and how do you stay focused?",
      "Once your homework is done, what’s your favorite way to unwind or play?",
      "Describe your evening wind-down: what happens from dinner until you climb into bed?",
      "Do you have a special bedtime ritual (story, song, stuffed animal)? What makes it comforting?",
      "How much time do you spend on screens each day, and what do you usually watch or play?",
      "How does using screens or watching shows affect how you feel before bedtime or during the day?",
      "What time do you set your alarm for on weekends, and how does it differ from weekdays?",
      "Do you get dressed right away in the morning, or do you linger in pajamas? Why?",
      "How long does it take you to brush your teeth in the morning versus at night?",
      "What clothes do you choose first when you’re picking an outfit—comfort, color, or style?",
      "Do you have a morning exercise routine, like stretches or jumping jacks? How often do you do it?",
      "What do you do if you wake up late—do you skip something, rush, or ask for help?",
      "When you leave the house, do you check for anything special—like your homework, lunch, or a jacket?",
      "What do you like to do on the bus or in the car while commuting to school—read, listen to music, or talk to friends?",
      "Do you ever stop for a quick play break before starting homework? What do you do in that break?",
      "What’s your routine for washing your face—do you use soap, water, or anything special?",
      "How do you organize your school supplies after you come home—do you unpack right away or wait?",
      "What’s your after-school ritual when you see a parent or guardian—do you give a hug, say hello, or show them something?",
      "Do you take a short nap or rest after school sometimes—when does that happen and how long do you sleep?",
      "How do you manage distractions while doing chores—do you put on music, time yourself, or ask for help?",
      "What is your favorite chore to do each day, and why do you enjoy it more than other chores?",
      "Do you help set the table for dinner—what items do you bring out and how do you arrange them?",
      "When it’s time for dinner, how do you let everyone know you’re ready to eat—do you call out, tap a spoon, or wait?",
      "What do you do with leftovers after dinner—help store them in the fridge, or save them for lunch the next day?",
      "Do you have a shower or bath routine—morning or evening? What steps do you follow and how long does it take?",
      "How often do you change into pajamas—immediately after dinner, or right before bed? Why?",
      "What do you do if you can’t fall asleep right away—count sheep, listen to a story, or use another trick?",
      "Do you keep a glass of water by your bed—when do you drink it and why?",
      "What do you do before brushing your teeth at night—do you floss, use mouthwash, or rinse?",
      "How do you decide when to call it a night—by time, by feeling sleepy, or based on a parent’s cue?",
      "Do you ever read or draw before bed—what kinds of stories or pictures help you relax?",
      "What’s your weekend morning routine—sleep in later, have a special breakfast, or do chores right away?",
      "Do you have a special plan for rainy days—stay inside with crafts, play board games, or watch movies?",
      "On days you don’t have school, how does your wake-up time and routine change?",
      "What’s your routine for putting away clean clothes—do you fold them, hang them, or sort them by color?",
      "How do you keep track of your dentist or doctor appointments—calendar, notes, or reminders from parents?",
      "Do you have a favorite afternoon snack habit—fruit, cookies, yogurt—and why do you like it?",
      "When you get home from a playdate or activity, what’s the first thing you do—wash hands, take off shoes, put away toys?",
      "What helps you remember to do chores—checklist, timer, or someone reminding you?",
      "If you miss something important (like a field trip form), what do you do to catch up—ask a parent, check your backpack, or email the teacher?",
      "How do you stay hydrated throughout the day—carry a water bottle, ask for water, or drink juice?",
      "Do you have a special spot for your homework—desk, table, or floor? Why did you choose that spot?",
      "What’s your routine for charging or powering up devices—phone, tablet, or gaming console—and how often do you do it?",
      "When it’s time to practice an instrument or skill, how do you remind yourself—timer, calendar, or parent’s prompt?",
      "What do you do if you forget to do something in your routine—like brush your hair or pack your book—how do you correct it?",
      "Describe a time you changed your routine—for example, when you started a new class—how did you adjust?",
      "What’s your holiday morning routine—sleep in, open presents, or have a special meal?",
      "How do you celebrate the end of the school week—Friday night traditions or weekend plans?",
      "What’s your evening routine on a movie night—popcorn, blankets, or choosing films together?",
      "How do you get ready for a sports day or field trip—pack a bag, choose shoes, or make a checklist?",
      "Do you practice any mindfulness or breathing exercises in your routine—when do you do them and how do they help?",
      "What’s your routine for taking care of your school uniform or clothes—washing, ironing, or laying them out?",
      "What do you do if you wake up in the middle of the night—go to the bathroom, get a drink, or try to sleep?",
      "How do your routines change when you’re on vacation—later wake-up times, different meals, or special activities?"
    ],
    "follow_up_questions": [
      "What made you choose that?",
      "How did you feel in that moment?",
      "Can you describe what you see, hear, or smell then?",
      "Why is that part your favorite (or least favorite)?",
      "How long have you been doing it that way?",
      "What’s the trickiest bit, and how do you handle it?",
      "Who usually helps you with this routine?",
      "If you could change one thing about it, what would it be?",
      "What memories pop up when you think about it?",
      "How do your family or friends react when they see you do this?",
      "What tools, toys, or apps do you rely on for this?",
      "Have you ever had a funny or surprising mishap during this?",
      "How does this routine shape the rest of your day?",
      "What advice would you give a friend who’s trying this for the first time?",
      "What’s one small detail about it that nobody else knows?",
      "How do you know when it’s time to move on to the next thing?",
      "What do you wish you did differently?",
      "If this routine were a story, how would you start it?",
      "When you look back in a year, what do you think you’ll remember most?",
      "Is there anything else about this part of your day you’d like to share?"
    ]
  },
  "Health & Nutrition": {
    "questions": [
      "What are your three favorite foods, and what makes them special?",
      "Is there a food you really dislike, and why don’t you like it?",
      "What usually happens at mealtimes in your house—who’s there, what do you talk about, and where do you eat?",
      "How do you feel when you try a completely new dish—excited, nervous, or something else?",
      "Can you remember a time recently when you realized you’d grown taller or stronger—what gave it away?",
      "What time do you usually go to sleep and wake up, and do you feel rested during the day?",
      "Have you ever had trouble sleeping—like waking up at night or having bad dreams? What is that like?",
      "Do you have any allergies or medical conditions—what should someone know about them and how do you manage them?",
      "What’s your tooth-brushing routine—when do you brush, for how long, and do you use a special toothpaste or song?",
      "How often do you wash your hands, and what reminds you to do it every time?",
      "What do you drink most often during the day—water, juice, soda? How does it make you feel?",
      "What snacks do you usually choose when you’re hungry between meals—why do you pick those snacks?",
      "How do you feel after eating a big meal versus a light snack—sleepy, energetic, or something else?",
      "Do you take any vitamins or supplements—when did you start, and how do they help you feel?",
      "What is your favorite healthy meal that you like to help prepare—what ingredients do you use?",
      "When you’re sick, what do you like to eat or drink to help you feel better—soup, tea, or something else?",
      "How do you know when you’re truly hungry versus when you’re just bored or thirsty?",
      "What’s your favorite way to exercise or stay active—running, swimming, dancing, or playing sports?",
      "Do you ever do yoga or stretching—what stretches do you find most relaxing?",
      "How do you feel when you skip breakfast—does it affect your mood or energy at school?",
      "What do you do to relax your mind before going to sleep—reading a book, listening to music, or something else?",
      "Do you take naps—when do you nap, and how long do you usually sleep during a nap?",
      "What bedtime drink or snack do you have before you go to sleep—warm milk, herbal tea, or a small snack?",
      "How do you feel when you exercise—tired, happy, energized? What’s your favorite sign that you had a good workout?",
      "What kinds of fresh fruits or vegetables do you eat most often—apples, carrots, berries? Which one is your favorite?",
      "How do you feel when you stay up late playing games or watching shows—do you regret it the next morning?",
      "What’s your routine for washing your face—do you use soap, a washcloth, or a special cleanser?",
      "How do you keep your nails clean—do you use a brush, wash with soap, or trim them often?",
      "Have you ever visited a dentist or doctor for a checkup—what was the visit like, and did you learn anything new?",
      "What household chores do you do to help keep your home clean—take out the trash, sweep the floor, or wipe counters?",
      "What do you do when you have a stomachache—sip water, rest, or ask for medicine?",
      "How do you feel when you eat too much candy or sweets—do you get tummy aches or feel wired?",
      "Do you prefer hot meals or cold meals—why? What’s your favorite hot dish versus your favorite cold dish?",
      "What is your favorite type of fruit juice—orange, apple, grape—and how often do you drink it?",
      "When you catch a cold, what foods or home remedies do you rely on to help you recover?",
      "How do you protect yourself from getting sunburned—wear sunscreen, a hat, or seek shade?",
      "What’s your morning skincare or grooming routine—wash face, comb hair, apply lotion, etc.?",
      "What’s your favorite way to stay warm in winter—soup, hot chocolate, sweater, or blanket?",
      "How often do you weigh yourself or check your height, and why do you think people do those checks?",
      "What do you do if you feel too hot in summer—drink cold water, stay indoors, or play in the sprinklers?",
      "How do you keep your sneakers or shoes clean after playing outside—wipe them down or wash them?",
      "What’s your favorite comfort food when you’re feeling sad—macaroni and cheese, ice cream, or something else?",
      "How do you manage a busy day—do you pack snacks, plan breaks, or tell your parents if you’re tired?",
      "Do you ever cook or bake with your family—what dish did you make and what did you learn?",
      "How do you store your lunch for school—insulated bag, thermos, or plastic containers? Why do you choose that method?",
      "What’s your favorite healthy dessert—fruit parfait, yogurt with toppings, or a baked treat?",
      "How often do you take baths versus showers, and which do you like more? Why?",
      "How do you keep your hair neat—brush it, tie it back, or use accessories?",
      "What do you do when you get a bruise or scrape—wash it, put on a bandage, or ask for help?",
      "What’s your favorite way to stay active indoors—jump rope, indoor obstacle course, or family dance party?",
      "How do you feel after eating fast food—satisfied, tired, or do you feel like doing something active?",
      "What’s your water-drinking habit—do you finish your water bottle, sip throughout the day, or forget sometimes?",
      "How do you cope with feeling anxious or stressed—talk to someone, draw, or take deep breaths?"
    ],
    "follow_up_questions": [
      "Why do you think that is?",
      "How did that make you feel in the moment?",
      "What sounds, tastes, or textures do you remember most?",
      "What part of that experience was your favorite?",
      "Which part was the hardest or least fun?",
      "Can you show me or draw what that looks like?",  
      "How long did it take, and what did you do while you waited?",  
      "What advice would you give someone else about this?",  
      "What surprised you the most about it?",  
      "How did you prepare for that, if at all?",  
      "Who else was there, and what did they do?",  
      "If you could change one thing, what would it be?",  
      "How often does this happen in your day or week?",  
      "What do you think causes that feeling or reaction?",  
      "How has it changed since last year or last time?",  
      "What do you think you’ll remember about this later on?",  
      "What questions do you still have about it?",  
      "How do you think it helps or affects you?",  
      "How would you explain this to a younger kid?",  
      "Is there anything else about this you’d like to share?"
    ]
  },
  "Emotional & Psychological": {
    "questions": [
      "How would you describe your usual mood—what feeling do you wake up with most days?",
      "What emotion do you notice most often during the day—happy, excited, calm, worried, or something else?",
      "Can you tell me about a time when you felt really adventurous—what happened and how did it feel?",
      "When you start to feel upset or anxious, what’s the first thing you do to help yourself calm down?",
      "Describe a moment when you used drawing, talking to someone, or breathing exercises to feel better—what was that like?",
      "Do you have any special tricks or habits for when you’re stressed, like counting, squeezing a toy, or listening to music?",
      "What’s your biggest fear—like the dark, tests, or being alone—and what do you do when that fear shows up?",
      "What kinds of worries pop into your head, and how do they affect what you do or think?",
      "What events or moments make you feel super excited or joyful, like birthdays, vacations, or special achievements?",
      "Can you share a story about a time you were proud of something you did—how did that joy feel in your body?",
      "How do you express happiness—smile, jump up and down, laugh out loud? Describe what that feels like.",
      "When you feel sad, where in your body do you notice it first—your chest, stomach, throat—and what do you do?",
      "Do you ever feel lonely even when you’re around people? What makes you feel less lonely?",
      "What’s a small thing that can instantly make you feel better when you’re having a bad day?",
      "Can you remember a time when you felt frustrated—maybe with school or friends—how did you handle it?",
      "What does anger feel like for you—hot, tight, tense—and how do you let it out safely?",
      "Have you ever felt jealous of someone—what triggered it and how did you overcome that feeling?",
      "When you’re worried about something, who do you talk to, and what do they say to help you feel better?",
      "What’s a time you felt embarrassed—what happened, and how did you react afterward?",
      "Can you describe a time when you felt proud of someone else—what did they do, and how did you show them you cared?",
      "What is something you do when you need to focus your mind—listen to music, doodle, or count backwards?",
      "How do you know when you’re truly relaxed—do you feel a weight lift off your shoulders, or does your breathing slow?",
      "What’s one thing that can instantly make you feel anxious—loud noises, big crowds, or a surprise test?",
      "When you feel the urge to cry, where are you, and what do you do—cry alone, ask for a hug, or put on music?",
      "What’s a happy memory that still makes you smile when you think about it—describe it in detail.",
      "If you could give a pep talk to yourself when you’re nervous, what words would you say?",
      "What does being ‘calm’ look like for you—sitting quietly, closing your eyes, or breathing deeply?",
      "Have you ever felt overwhelmed by too many thoughts—what strategy helped you clear your mind?",
      "When you’re angry with someone, what helps you forgive them or let go of that anger?",
      "What’s a comforting routine you have when you’re sad—like wrapping in a blanket, reading a favorite book, or hugging a stuffed animal?",
      "Do you ever feel homesick when you’re away—how do you cope with missing home or family?",
      "How do you celebrate a small win—like finishing a book or tying your shoes on your own?",
      "Have you ever felt guilty about something you did—how did you make amends or forgive yourself?",
      "What’s the first thing you do when you wake up feeling anxious—take deep breaths, stretch, or think about a happy thought?",
      "How do you handle the disappointment of not winning a game or not doing well on a test—do you talk to someone or try again later?",
      "What’s a time you felt inspired or motivated—what triggered that feeling and how did you act on it?",
      "Have you ever felt confused about how you feel—happy and sad at the same time—what was going on?",
      "What does being ‘brave’ mean to you—stand up for a friend, try something new, or speak in front of class? Give an example.",
      "When you’re feeling exhausted or mentally drained, how do you recharge—take a nap, listen to music, or talk it out?",
      "What role does laughter play in your day—what makes you laugh hardest, and how do you share it with others?",
      "Have you ever felt proud of learning from a mistake—what did you learn and how did it change you?",
      "What’s a time you felt a deep sense of peace—maybe in nature, after a big storm, or during a quiet sunrise—describe it.",
      "How do you feel when someone gives you a compliment—blush, smile, or turn away? What do you say in response?",
      "What’s a worry you used to have that you’ve outgrown—how do you handle it now compared to before?",
      "When you see someone else upset, how do you comfort them—offer words, a hug, or just sit quietly with them?",
      "What’s a time you felt surprised by your own courage—maybe trying a new food, making a new friend, or speaking up?",
      "How do you approach a big change—new school year, moving houses, or a new sibling—what helps you adjust?",
      "What helps you distinguish between ‘real’ worries and ‘made-up’ worries—do you talk it out, write it down, or use another trick?",
      "When you set a personal goal—like reading more or practicing piano—how do you track your progress and keep yourself motivated?",
      "What’s a time you felt a sense of awe—looking at the night sky, watching a thunderstorm, or hearing a beautiful piece of music?",
      "How do you feel when you receive constructive criticism—do you take notes, ask questions, or go do something else first?",
      "Can you describe a time when you felt determined to solve a problem—what steps did you take, and how did it feel when you succeeded?",
      "What’s your go-to phrase or mantra when you need encouragement—‘I can do it,’ ‘One step at a time,’ or something else?",
      "When you look back on a tough day, how do you remind yourself that tomorrow can be better—write, talk, or think of a happy memory?",
      "What’s one small thing you do every day that brings you joy—feed your pet, draw a doodle, or listen to a favorite song?"
    ],
    "follow_up_questions": [
      "What made you feel that way?",
      "Why was that important to you?",
      "How did your body react when that happened?",
      "Can you tell me more about what you were thinking at the time?",
      "Who did you turn to or talk to when you felt like that?",
      "What sounds, smells, or sights do you remember from that moment?",
      "If that feeling had a color or shape, what would it be?",
      "What did you learn from experiencing that?",
      "How often does that feeling or situation come up for you?",
      "What helps you move on after feeling like that?",
      "What would you say to a friend who’s going through the same thing?",
      "How has your response changed since the first time you felt it?",
      "What surprised you most about that experience?",
      "If you could go back, would you do anything differently? Why or why not?",  
      "How do you think that feeling affects other parts of your day?",  
      "What do others around you do when they see you feeling like that?",  
      "When you look back later, what do you think you’ll remember most?",  
      "If this were a story, how would you begin or end it?",  
      "What advice would you give your younger self about handling this?",  
      "Is there anything else you’d like to share that I didn’t ask?"  
    ]
  },
  "Social World & Peer Relationships": {
    "questions": [
      "Who is your best friend, and how did you two become buddies?",
      "What do you and your friends like to do together when you hang out?",
      "How do you decide who’s “in” your group at school or during playtime?",
      "Can you tell me about a time you felt left out of a game or clique? What happened?",
      "What do you do when you and a friend disagree or argue—how do you fix it?",
      "Have you ever seen someone being bullied? What did you do, or wish you had done?",
      "When someone else is upset with you, how do you make things right again?",
      "Who do you look up to—whether it’s a family member, celebrity, or story character—and why?",
      "What qualities in your role models do you admire most, and how do you try to be like them?",
      "If you could invite any hero (real or fictional) to spend a day at your school, who would it be and what would you ask them?",
      "How do you meet new friends—through sports, class projects, or neighborhood play? Describe your favorite way.",
      "What do you and your friends talk about when you’re sitting together—jokes, schoolwork, hobbies, or secrets?",
      "Have you ever had to stand up for a friend—what was the situation, and how did you help them?",
      "Do you have a group chat or online hangout with your friends—what do you share there?",
      "What’s your favorite nickname that a friend has given you, and how did it come about?",
      "How do you feel when a friend moves away or changes schools—what do you miss most about them?",
      "What’s a funny or silly inside joke you share with your friends—where did it start?",
      "How do you include a shy or new student in your games—what do you say or do to make them feel welcome?",
      "Can you describe a time you helped a friend with a problem—what advice did you give, and how did it work out?",
      "What do you do when a friend invites you to do something you’re not comfortable with—how do you say no?",
      "How do you handle it when a friend gets too bossy or takes control of your play—what do you do to stay fair?",
      "Have you ever had to apologize to a friend—what did you do or say, and how did they react?",
      "What do you think makes a friendship last—loyalty, honesty, shared interests, or something else?",
      "How do you celebrate a friend’s achievement—winning a game, getting a good grade, or learning a new skill?",
      "What’s a time you felt jealous of a friend—what did they do, and how did you talk about it with them?",
      "Do you have a “best-friend gift” you gave or received—what was it, and why was it special?",
      "How do you decide who to invite to a group project—do you pick based on skill, friendship, or someone new?",
      "What’s your favorite way to make new friends during a school trip or camp—team games, crafts, or campfire stories?",
      "Have you ever had to tell a friend a difficult truth—like that they were being unfair—how did you approach it?",
      "How do you know when to forgive a friend after an argument—what signs tell you they’re sorry?",
      "What role does kindness play in your friendships—how do you show kindness to your friends?",
      "If you and a friend want different activities—one wants to play soccer, the other wants to draw—how do you decide what to do?",
      "What’s a time you felt proud because you helped a friend feel better—what happened and how did they react?",
      "How do you support a friend who is nervous or anxious—do you listen, give advice, or distract them with fun?",
      "What’s a group activity you started with your friends—like a mini book club or weekend bike rides—and how did it grow?",
      "What do you and your friends do to keep in touch during school holidays—letters, video calls, or visits?",
      "How do you handle it when a friend changes and you don’t understand why—do you ask questions or give them space?",
      "What’s a time you felt inspired by something a friend did—maybe they tried a new sport or learned an instrument—how did it motivate you?",
      "Do you ever cooperate on a creative project—building a fort, writing a story, or making a YouTube video—what was your role?",
      "What qualities do you value most in a friend—trustworthiness, humor, kindness, or something else? Give an example of each.",
      "How do you help a friend who is being left out by others—do you invite them to join, talk to the group, or stand up for them?",
      "What’s a time you felt disappointed when a friend didn’t show up or canceled—how did you talk about it later?",
      "Do you ever have “friendship challenges” like miscommunication or jealousy—how did you work through those?",
      "What’s a way you celebrate a friend’s birthday—party, homemade cards, or a special treat? Describe your favorite celebration.",
      "What’s your favorite game to play with siblings or cousins—hide-and-seek, board games, or video games? Why is it special?",
      "How do you balance time between old friends and new friends—do you plan specific days to see each group?",
      "What’s a time you and your friends collaborated to solve a problem—maybe building a fort or organizing a club—what happened?",
      "Do you have a special handshake, secret code, or sign you share with your best friend—how did you invent it?",
      "When you see a friend struggling with homework or tasks, how do you offer help—explain, demonstrate, or do it together?",
      "What’s a time you felt grateful for a friend’s help—describe what they did and how you thanked them?",
      "How do you include a quiet or shy classmate in your games—ask them directly, show them how to play, or pair them with a buddy?",
      "What’s a playdate or sleepover tradition you have—movie marathon, pillow fort, or midnight snacks? Why is it fun?",
      "How do you handle gossip or rumors at school—do you ignore it, talk to the friend, or stand up for someone being talked about?",
      "What’s a time you helped plan a surprise for a friend—birthday, holiday, or special occasion—how did you keep it secret?",
      "Who in your class makes you laugh the most—and what do they do or say that’s so funny?",
      "If you had to teach a lesson about friendship to younger kids, what would be the key points you would share?",
      "What do you do if you see someone being excluded at recess—invite them to join, talk to an adult, or start a new game with them?",
      "How do you and your friends celebrate the end of a difficult week—ice cream, video game night, or a backyard campout?",
      "Have you ever written a letter or given a card to a friend—what did you write or draw to show you care?"
    ],
    "follow_up_questions": [
      "What made you think of that?",
      "How did you feel at that moment?",
      "Why is that memory important to you?",
      "Can you give me a specific example of when that happened?",
      "How did the other person react?",
      "What did you learn from that experience?",
      "If you could do it over, what would you change?",
      "Who else was there and what did they do?",
      "What advice would you give a friend in the same situation?",
      "How did you prepare or get ready for that interaction?",
      "What surprised you most about what happened?",
      "How do you think the other person felt?",
      "How did that change your friendship afterward?",
      "When you look back, what detail stands out the most?",
      "How would you handle it differently next time?",
      "What qualities do you share with your hero?",
      "What advice do you think your role model would give you?",
      "How do you feel when you see your hero doing something great?",
      "What would you most want to ask your hero if they were here?",
      "Is there anything else about that moment or person you’d like to share?"
    ]
  },
  "Cognitive & Moral Development": {
    "questions": [
      "How do you usually figure out how to solve a problem—do you think it through step by step or just try things until something works?",
      "Can you tell me about a time you faced a tricky puzzle or task—what was your first move?",
      "When you get stuck on something, what do you do next—ask for help, try a different idea, or keep at it?",
      "How do you decide what’s fair when you’re sharing items or taking turns?",
      "If you found a lost toy on the playground, what would you do and why?",
      "What does “being honest” mean to you, and how do you know when you’re telling the truth?",
      "How do you think about time like “yesterday,” “today,” and “tomorrow”—what makes them different?",
      "What’s your plan for a typical day—from waking up to going to bed—and how do you keep track of it?",
      "Imagine you have two tasks—a quick one and a long one—which do you tackle first, and how do you decide?",
      "Tell me about a time you had to wait for something important—how did you know when it was your turn or when it would happen?",
      "When you’re in a group project, how do you pick who does which job—volunteer, assign randomly, or take turns choosing?",
      "How do you handle it when someone breaks the rules while you’re playing—tell a teacher, talk to them, or do something else?",
      "What steps do you take when you want to learn something new—watch a video, read a book, or ask an expert?",
      "If you make a promise to a friend, how do you remember to keep it—write it down, repeat it out loud, or set a reminder?",
      "How do you figure out if an answer in math is right—do you check with another method, ask someone, or trust your instinct?",
      "When you plan a small project—like building a LEGO model—how do you organize the steps before you start?",
      "What do you do if you see someone being treated unfairly—stand up for them, tell a teacher, or try to understand why it happened?",
      "How do you decide whether to share your snacks with friends—do you think about their feelings, the rules, or something else?",
      "If you have to choose a team captain, what qualities do you look for—fairness, skill, or leadership?",
      "How do you tell if someone else is telling the truth—look at their body language, listen to their words, or compare with what you know?",
      "What do you do when you realize you made a mistake—say sorry right away, try to fix it, or wait until someone notices?",
      "When you have to finish homework and play outside, how do you prioritize your time—finish all homework first or mix them?",
      "If a friend wants to take turns but you’re losing, how do you keep it fair while still trying your best?",
      "How do you decide if something is fair—equal turns, equal pieces, or equal time? Give an example.",
      "If you see a rule that doesn’t make sense, what do you do—follow it anyway, ask why, or suggest a change?",
      "When you find a lost password or secret code, what do you do—tell the owner, keep it to yourself, or try to figure it out?",
      "How do you think computers follow instructions—step by step like recipes or in big chunks of code?",
      "What do you do when you need to remember a sequence—like steps in a game—use rhymes, make up a song, or write notes?",
      "If you had to teach someone how to tie their shoes, how would you break down the steps so they could learn easily?",
      "How do you decide if it’s right to tell on a friend who is breaking a rule—do you think about the consequences, feelings, or something else?",
      "If you have two options that both seem good—like ice cream or cake—how do you choose? Make a list of pros and cons?",
      "When you solve a riddle or brainteaser, how do you check that your answer really fits the clues?",
      "If you found a pencil that wasn’t yours, how would you figure out who it belongs to—ask around, notice handwriting, or use another trick?",
      "What do you think is more important—following rules or helping someone in need—and how do you choose when both matter?",
      "When you make a schedule for your day, how do you handle unexpected events—reschedule, delay, or drop something?",
      "If you see two friends arguing, how do you decide who is right—listen to both sides, ask for details, or come up with a compromise?",
      "How do you understand a sequence of events—like morning routines—by thinking about what comes first, second, and third?",
      "What do you do if you see someone being excluded—invite them to join, talk to others, or do something else?",
      "If you need to remember a list of items—groceries, chores—do you make a rhyme, draw pictures, or use another method?",
      "How do you decide whether to share homework answers—help them learn or keep your grade safe?",
      "What steps do you take when you want to build something—gather materials, sketch a plan, or start building right away?",
      "If you promise to keep a secret, when is it okay to tell someone else—if it’s hurting them, if an adult asks, or never?",
      "How do you figure out the order of events in a story—look for words like 'first', 'next', 'then', or draw a timeline?",
      "When you give feedback to a friend, how do you make sure it’s kind but honest—use ‘I’ statements, give examples, or ask permission first?",
      "If you’re playing a game and aren’t sure of the rules, how do you decide what to do—ask someone, look it up, or make a fair guess?",
      "What do you do to remember your homework or school plan—set alarms, jot notes, or tell someone else?",
      "If a friend asks you to lie for them, how do you decide—protect their secret, tell the truth, or say no politely?",
      "How do you break big tasks into smaller steps—like cleaning your room by starting with toys, then books, then clothes?",
      "What do you think is fair when splitting a pizza—equal slices by size, toppings, or who has the bigger appetite?",
      "If you’re playing a video game and get stuck on a level, how do you decide whether to ask for help or keep trying?",
      "How do you organize your day when you have school, practice, and chores—use a timeline, color code, or check off boxes?",
      "What do you do when you realize someone else might be feeling left out—invite them, create a new game, or talk to them quietly?",
      "If you have to choose between being honest and being popular, which would you pick and why?",
      "How do you decide when to share your ideas versus when to listen—look at body language, wait your turn, or use hand signals?"
    ],
    "follow_up_questions": [
      "Why did you decide to do it that way?",
      "What made you think of that idea first?",
      "How did you feel when you tried that?",
      "What was the trickiest part for you?",
      "Can you describe what you noticed around you at the time?",
      "Who did you talk to or get help from, if anyone?",
      "What would you try differently next time?",
      "What did you learn from that experience?",
      "How do you tell if something is fair or not?",
      "What clues help you know when something will happen?",
      "What surprised you most about how it turned out?",
      "How long did it take from the beginning to the end?",
      "If you were teaching a friend, what steps would you show them?",
      "What else were you thinking about while you worked on it?",
      "How would you explain this to someone who’s never done it before?",
      "What did you notice in your body when you felt that way?",
      "What happens next after that step?",
      "How do you keep track of what you need to do later?",
      "What could make this task more fun or easier?",
      "Is there anything else you’d like to share about that?"
    ]
  },
  "Digital & Media Environment": {
    "questions": [
      "What devices do you own or use most often (e.g., tablet, console, smartphone, computer)?",
      "How do you decide which device to use for different activities (games, homework, videos)?",
      "Where in your home do you usually use your devices, and what does that space look or feel like?",
      "On an average school day, how much time do you spend on screens before, during, and after homework?",
      "What’s your favorite TV show, movie, or YouTube channel right now, and what do you like about it?",
      "How do you find new shows, videos, or apps—do you search on your own, or does someone recommend them?",
      "What rules or limits do your parents or guardians set around screen time and online use?",
      "Have you ever encountered something online that made you uncomfortable or worried—what did you do?",
      "If you could design your own app or channel, what would it be called and what would it do?",
      "Who do you talk to if you have a question or problem while you’re online or using a device?",
      "What’s the first thing you do when you get a new gadget—charge it, explore settings, or ask for help?",
      "How do you keep track of passwords or accounts for different apps—write them down, use a password manager, or ask a parent?",
      "What social media platform do you use (if any), and what do you like or dislike about it?",
      "How do you decide which videos are safe to watch online—check age ratings, read comments, or ask a grown-up?",
      "What’s your favorite educational website or app, and how does it help you learn?",
      "Do you have any online friends you’ve never met in person—how do you know they’re trustworthy?",
      "Have you ever created digital art or edited photos—what software or app did you use?",
      "What kind of music do you listen to online, and how do you choose songs or playlists?",
      "What’s your process for searching for information online when you have a homework question?",
      "How do you feel when your device’s battery is low—do you get anxious, or plan ahead to recharge?",
      "Do you prefer playing single-player games or multiplayer games, and why?",
      "How do you manage notifications—do you turn off alerts, mute certain apps, or keep everything on?",
      "What’s a time you learned something surprising online—what was it and how did you discover it?",
      "How do you handle ads or pop-ups when you’re browsing—ignore, close them, or ask for help?",
      "What’s your strategy for finding reliable information online—check multiple sources, look for official sites, or ask an adult?",
      "Have you ever participated in an online challenge or contest—what was the challenge, and what did you learn from it?",
      "What’s the most creative thing you’ve made with a digital tool—video editing, animation, or coding?",
      "How do you keep your device clean—wipe the screen, clean the keyboard, or use protective cases?",
      "Do you ever use voice assistants (like Siri or Alexa)—what questions do you ask them?",
      "What’s a podcast you enjoy (or would like to start), and what topics would it cover?",
      "How do you balance online gaming with outdoor play—set timers, take breaks, or rely on parents to remind you?",
      "What’s the funniest meme or clip you’ve seen online—why did it make you laugh?",
      "How do you feel about virtual reality or augmented reality—have you tried it, and what was it like?",
      "Have you ever built a simple website or blog—what did you write or share on it?",
      "What’s your favorite way to communicate with friends—text, voice chat, video call, or emojis?",
      "Do you use any parental control or monitoring apps—how do they work and do you find them helpful?",
      "What’s a time you helped someone troubleshoot a tech problem—what steps did you take?",
      "How do you decide if a game or app is worth downloading—read reviews, watch gameplay videos, or ask friends?",
      "Have you ever streamed a live video or watched someone else stream—what did you enjoy about it?",
      "What do you think is the most important skill for using technology safely—critical thinking, asking for help, or following rules?",
      "How do you handle a slow or glitchy device—restart it, clear memory, or ask for technical help?",
      "What’s a time you collaborated with classmates online—video call study session, shared document, or group chat?",
      "Do you use any coding or robot-building kits—what have you created with them?",
      "How do you protect your privacy online—use fake usernames, hide personal info, or only talk to known people?",
      "What’s the most interesting fact you’ve discovered in an online game—easter egg, secret level, or trivia?",
      "Have you ever written a digital story or created a slideshow for school—what tools did you use and what was the topic?",
      "How do you organize your desktop or home screen—folders, shortcuts, or widgets?",
      "What’s your favorite time of day to be online—early morning, afternoon after school, or late evening—and why?",
      "How do you feel when you get a new software update—excited for new features or worried something might break?",
      "What’s a life lesson you’ve learned from playing a multiplayer game—teamwork, patience, or strategy?",
      "If you could create a digital world or game level, what would the theme be and what challenges would you include?",
      "How do you handle peer pressure regarding online trends or challenges—say no, set your own rules, or talk to a friend?",
      "What’s the longest time you’ve gone without screens—what did you do instead, and how did it feel?",
      "How do you decide which digital photos or videos to keep versus delete—quality, memories, or space?",
      "What do you do to prepare for a long trip—download movies, pack headphones, or bring a power bank?"
    ],
    "follow_up_questions": [
      "What made you choose that device or app?",
      "Can you walk me through exactly how you start using it step by step?",
      "How do you feel when you’re watching or playing on that device?",
      "What do you notice first—the colors, sounds, or something else?",
      "Who else is usually around when you’re using it, and what do they do?",
      "What would you say to a friend who wanted to try it for the first time?",
      "What was surprising or unexpected about your experience?",
      "What’s the hardest part about using that device or app?",
      "How do you solve a problem if something freezes or doesn’t work?",
      "What settings or parental controls are in place, and how do they help you?",
      "How do your parents or guardians react if you break a screen-time rule?",
      "What do you do when you finish a video or level—do you switch right away or take a break?",
      "What time of day do you prefer using screens, and why?",
      "How does using screens affect what you do afterward—play, homework, sleep?",
      "If you could add one feature or change one thing, what would it be?",
      "How do you balance screen time with outdoor play or other activities?",
      "Have you ever shown someone else how to use an app or gadget—what did you teach them?",
      "What do you imagine is happening behind the scenes when the app loads or runs?",
      "How do you feel when you can’t use a device for a while?",
      "Is there anything else about your digital world or media habits you’d like to share?"
    ]
  },
  "Values, Beliefs & Worldview": {
    "questions": [
      "What family or religious traditions do you take part in, and what personal meaning do they hold for you?",
    "Which holiday or celebration in your family is your favorite, and how do you participate in it?",
    "How do the customs your family follows—like saying prayers or wearing special clothes—shape your sense of identity?",
    "What does being a good person mean to you, and how do you decide what actions are right or wrong?",
    "Can you describe a time you faced a moral dilemma—what was it and how did you choose what to do?",
    "Which values (honesty, kindness, respect, etc.) are most important in your household, and how do you practice them daily?",
    "How do your beliefs about nature or the environment influence the way you treat animals and plants?",
    "Do you have any pets or favorite animals—what lessons about responsibility or compassion have they taught you?",
    "What kind of world or future do you imagine when you grow up, and what steps do you think are necessary to create it?",
    "If you could change one thing about how people treat the planet, what would it be and why?",
    "How do you reconcile scientific facts and any spiritual or religious beliefs you hold?",
    "What do you believe is the purpose of life, and how did you come to that conclusion?",
    "How do you respond when someone’s beliefs differ from yours—do you ask questions, argue, or listen quietly?",
    "What role does gratitude play in your life—how do you express thanks to family or friends?",
    "What does fairness mean to you, and how do you practice fairness when sharing or taking turns?",
    "Can you recall a moment when you had to apologize—what did you learn from that experience?",
    "How do you decide whom to trust, and what qualities do you look for in a trustworthy person?",
    "What does forgiveness mean to you, and can you share a time when you forgave someone or were forgiven?",
    "How do stories or myths from your cultural background shape your worldview and values?",
    "What lessons about generosity have you learned from your family, and how do you give to others?",
    "How do you balance following traditions with trying new things that might be different?",
    "What are your thoughts on honesty—are there times when it’s better to be silent or to tell a white lie?",
    "How do you feel about rules and authority—do you follow them strictly, question them, or sometimes bend them?",
    "What do you believe about helping people in need, and what volunteer or charitable activities interest you?",
    "How do you decide what is fair in a disagreement between friends, and how do you help mediate?",
    "What is your attitude toward people from different cultures or countries, and how do you learn about them?",
    "Do you have any beliefs about fate or destiny—do you think you control your own future or something else does?",
    "What do you think happens after we die, and how does that belief influence your daily life?",
    "How do you use imagination or storytelling to explore moral questions or ethical dilemmas?",
    "What lessons about teamwork and community have you learned in school or sports?",
    "How do you feel when you see someone being treated unfairly, and what do you think you should do?",
    "What values do your friends admire in you, and how do you try to live up to their expectations?",
    "How do you reflect on your own mistakes—do you journal, talk to someone, or think quietly?",
    "What beliefs or values have changed for you as you’ve grown older, and why?",
    "How do you use creativity—drawing, writing, playing—to express your beliefs and hopes for the future?",
    "What role do heroes or role models play in shaping your ideas of courage and integrity?",
    "How do you feel about technology’s impact on the world, and what ethical questions does it raise?",
    "What responsibilities do you think children have in taking care of the environment and community?",
    "How do you explain concepts like justice and equality in your own words?",
    "What do you believe about money and wealth—should people share, save, or spend, and why?",
    "How do you think we should treat animals, and what ethical considerations do you use?",
    "What does cooperation mean to you, and how have you practiced it in group projects or games?",
    "How do you respond to unfair treatment at school—do you speak up, seek help, or try to resolve it yourself?",
    "What questions do you still have about right and wrong, and who do you ask when you’re unsure?",
    "How do you balance your own needs with the needs of others in your family or friend group?",
    "What do you believe about courage—when is it important to be brave, and when is it better to wait?",
    "How do you feel about standing up for someone who is bullied or excluded?",
    "What traditions would you like to start in your own future family, and why?",
    "How do you think your values will evolve as you grow into an adult?",
    "What does “living a good life” mean to you, and how do you hope to achieve it?",
    "How do you use conversation or questions to understand someone who thinks differently?",
    "What act of kindness do you remember most vividly, and why did it touch you?",
    "How do you reconcile feelings of fear or anger with your belief in compassion and forgiveness?"
    ],
    "follow_up_questions": [
      "Why is that tradition or custom meaningful to you?",
      "What sights, sounds, or smells do you associate with that celebration?",
      "How has your view of it changed as you’ve gotten older?",
      "What questions do you still have about why your family follows that practice?",
      "Can you share a specific story about that tradition in action?",
      "What were the hardest and easiest parts of making that choice?",
      "How did others react when you chose one way over another?",
      "What did you learn about yourself from that experience?",
      "Who else in your life models these values, and how do they show it?",
      "How do you remind yourself to act on those values every day?",
      "What role do animals or nature play in your favorite activities?",
      "How would you explain to a friend why it’s important to protect the environment?",
      "If you could send one message to everyone about caring for the planet, what would it be?",
      "What worries you most about the future of animals, nature, or the Earth?",
      "What gives you hope when you think about tomorrow’s world?",
      "How do you show kindness or respect in your everyday actions?",
      "What’s one small thing you’ve done recently to help someone or something?",
      "How would you teach a younger sibling or friend about these beliefs?",
      "How do you think your values might change as you get older?",
      "Is there anything else about your beliefs, hopes, or traditions you’d like to share?"
    ]
  },
  "Dreams, Goals & Aspirations": {
    "questions": [
      "What’s one thing you’d really love to have or do in the next week—like a new toy, a trip, or an activity?",
      "If you could wish for one special surprise tomorrow, what would it be and why?",
      "What’s a goal you’re working on this month—maybe learning something new or finishing a project?",
      "When you think about growing up, what job or career do you dream of having, and what makes it exciting?",
      "If you could invent anything to make life better or more fun, what would you create and how would it work?",
      "Is there a place or country you’d love to visit someday—what would you do there first?",
      "What’s one big thing you hope to accomplish before your next birthday?",
      "How do you picture yourself ten years from now—what are you doing and who are you with?",
      "What qualities or skills do you like most about yourself, and what’s one thing you’d like to get even better at?",
      "If you could be the “ideal” version of you for a day, what would you change or enhance about yourself?",
      "What’s a new hobby or sport you’d like to try, and why does it interest you?",
      "If you could learn any instrument, which one would you pick and what song would you play first?",
      "What book would you like to write or illustrate when you’re older, and what would the story be about?",
      "If you collected something as a life-long hobby—stamps, coins, or action figures—what would it be and why?",
      "What’s a skill you admire in someone else—like cooking, painting, or coding—and how do you plan to learn it?",
      "If you could start a club or group for kids at your school, what would it be called and what would you do together?",
      "What’s a challenge you’d like to overcome this year—learning to ride a bike, swim, or solve a Rubik’s Cube?",
      "When you think about your future home, what kind of house or environment would you like to live in?",
      "If you could build a dream treehouse or fort, what features would it have?",
      "What’s a long-term project you’d like to start—writing a novel, planting a garden, or building a model city?",
      "If you could teach others something you’re good at, what would you teach and how would you start?",
      "What’s a way you’d like to give back to your community—volunteering at a shelter, planting trees, or helping neighbors?",
      "If you could spend a year learning from a mentor, who would you choose and what would you want to learn?",
      "What’s a fear you’d like to conquer—speaking in front of a crowd, performing on stage, or learning to skate?",
      "If you could travel back in time to witness a historical event, which one would you choose and why?",
      "What’s a sport or competition you’d like to win—soccer tournament, swimming race, or a math contest?",
      "If you could speak any language fluently, which language would you choose and what would be the first thing you say?",
      "What’s a musical performance you’d like to give—solo, band, or choir—and what song would you perform?",
      "If you could design your perfect school day, what subjects or activities would you include?",
      "What’s a scientific experiment you’d like to conduct—volcano model, rocket launch, or a robot build?",
      "If you could collaborate on a project with someone famous (author, scientist, athlete), who would it be and what would you do together?",
      "What’s a poem or song you’d want to write to express your feelings—what would be the theme?",
      "If you could host a TV show or YouTube channel, what would it be about and who would your first guest be?",
      "What’s a dream vacation you’d plan with your family—where would you go and what adventures would you have?",
      "If you could create a new holiday, what would it celebrate and how would people observe it?",
      "What’s a business or lemonade stand idea you’d like to start—what would you sell and where would you set up shop?",
      "If you could build a robot to help you with chores, what tasks would it do and what would it look like?",
      "What’s a fundraising campaign you’d organize for a cause you care about—animals, environment, or education?",
      "If you could paint a large mural anywhere—school wall, community center—what scene or message would you choose?",
      "What’s a dance routine you’d choreograph for a school performance—what music and steps would you include?",
      "If you could dress up as any character for a day, who would it be and what would you do in costume?",
      "What’s a puzzle or board game you’d design—what are its rules and how do players win?",
      "If you could write a letter to a world leader, what would you ask or suggest to make the world better?",
      "What’s a difficult habit you’d like to develop—waking up early, daily reading, or practicing an instrument—and how will you stick with it?",
      "If you could create a time capsule, what five items would you put inside to represent your life today?",
      "What’s a science fair idea you’d love to present—growing crystals, solar oven, or water filtration?",
      "If you could lead a community cleanup event, where would you start and who would you involve?",
      "What’s a personal record you’d like to set—fastest mile run, most books read in a month, or tallest LEGO tower?",
      "If you could visit any planet or explore the ocean depths, where would you go and what would you hope to find?",
      "What’s a new invention or gadget you’ve sketched in your notebook—describe its features and purpose?"
    ],
    "follow_up_questions": [
      "Why did you choose that wish or goal?",
      "What would make that surprise extra special?",
      "How will you know when you’ve achieved it?",
      "What’s the first step you’d take to make it happen?",
      "Who could help you reach that goal, and how?",
      "What challenges might you face, and how would you handle them?",
      "How would you celebrate once you’ve done it?",
      "What do you imagine seeing, hearing, or feeling when it happens?",
      "How does it compare to other wishes or dreams you’ve had?",
      "What inspires you about that job, invention, or place?",
      "If you had unlimited resources, how would your answer change?",
      "How does this dream reflect what matters most to you?",
      "What skills or habits will you need to develop?",
      "Can you picture a day in the life of that future you—what happens?",
      "What’s one thing you can do today to move closer?",
      "Who in your life shares a similar dream, and what can you learn from them?",
      "How might this goal change the way you feel about yourself?",
      "What worries you about working toward it, and how can you ease that worry?",
      "If someone else asked you for advice on this, what would you tell them?",
      "Is there anything else about your dreams or goals you’d like to share?"
    ]
  },
  "Personal Safety & Well-being": {
    "questions": [
      "What are some things around your home or playground that you know can be dangerous, and how do you stay safe from them?",
      "How do you decide if it’s okay to go somewhere outside—like crossing the street or playing near a road?",
      "What would you do if a stranger you didn’t know tried to talk to you or give you something?",
      "How do you let someone know you don’t want to be touched or hugged—what do you say or do?",
      "Who are the grown-ups you feel safest telling “no” to, and how did you learn they’re trustworthy?",
      "If you ever got hurt or saw someone else get hurt, how would you know when and how to call for help?",
      "Can you tell me step-by-step what you would do if you fell and scraped your knee?",
      "What supplies (like band-aids or ice packs) do you keep at home for small injuries, and where are they?",
      "When you feel upset or scared, how do you let people know you need help or a break?",
      "What rules or tips have your parents, teachers, or coaches given you about staying safe in unexpected situations?",
      "How do you keep track of which doors or windows should stay locked at home—do you check them before bedtime?",
      "What do you do if you smell something strange—like gas, smoke, or chemicals—inside the house?",
      "If you see a broken glass or sharp object on the floor, how would you handle it to make sure no one gets hurt?",
      "What’s your plan if there’s a fire alarm at school—where do you go, and who do you meet up with?",
      "How do you practice crossing a busy street safely—look both ways, hold a hand, or wait for signals?",
      "What do you do if you’re home alone and someone knocks on the door—do you peek through a window, ask who it is, or call an adult?",
      "How do you make sure you’re visible when riding your bike—wear bright clothes, use lights, or a helmet?",
      "What would you do if you saw someone bullying another kid—would you step in, get help, or try to separate them safely?",
      "How do you set boundaries when playing with friends—like not jumping on someone or hitting too hard?",
      "If you’re at a park and get separated from your family, what steps would you take to find them or ask for help?",
      "What do you do if you start feeling dizzy or very tired during a game—ask for water, sit down, or call a friend for help?",
      "How do you practice safe use of playground equipment—go down slides feet-first, hold rails on monkey bars, or wait your turn?",
      "If you find a medication or pill on the floor, what do you do to make sure no one eats it by accident?",
      "What’s your routine when getting into a car—do you check the seatbelt, sit in the correct seat, or make sure doors are locked?",
      "How do you know when it’s time to rest if you feel too sore or achy—ask an adult, lie down, or take a break from activity?",
      "If someone offers you a ride after school, what questions do you ask to make sure it’s safe—who they are, where they’re going?",
      "How do you handle peer pressure to do something risky—like climbing too high on a tree or trying a dare?",
      "What do you do when you feel unwell at school—tell a teacher, go to the nurse’s office, or call home?",
      "How do you decide when to wear sunscreen or a hat outside—sunny days, long play sessions, or if your skin feels hot?",
      "If you get lost while walking home, what steps do you take—stay where you are, ask a safe adult, or call your parents?",
      "How do you stay safe around animals—ask permission before petting, watch for warning signs, or keep a safe distance?",
      "What do you do if you see water pooling near electrical outlets or cords—do you unplug devices, tell an adult, or keep clear?",
      "If there’s a heavy storm or thunder, how do you make sure you’re protected at home—stay away from windows, unplug electronics, or go to a safe room?",
      "How do you practice telling time so you know when you should be home—use a watch, set an alarm, or check a clock?",
      "What steps do you take when you’re going out with friends—share your location, agree on a meeting spot, or give your phone number to an adult?",
      "How do you recognize when someone’s behavior makes you uncomfortable online—strange messages, requests for personal info, or bad language—and what do you do about it?",
      "If you feel overwhelmed or anxious, what breathing exercises or calming techniques do you use to help yourself feel better?",
      "How do you keep track of your emergency contact information—memorize phone numbers, store them in your phone, or write them on a card?",
      "What do you do if you break something in the house—tell an adult, attempt to fix it, or clean up the mess safely?",
      "How do you maintain healthy boundaries with siblings—taking turns with toys, giving each other space, or asking to join when they play?",
      "If you see a stranger taking pictures of you or your friends without asking, what would you do—approach them, move away, or call an adult?",
      "What’s your plan if you smell something burning—check the stove, unplug appliances, or alert a grown-up right away?",
      "How do you make sure you stay hydrated when playing outside all day—carry a water bottle, set reminders, or drink at regular breaks?",
      "What do you do if you feel your mood getting worse—tell someone, write in a journal, or do a favorite calming activity?",
      "How do you help a younger sibling or friend stay safe—wear seat belts, use helmets, or follow house rules when they visit your home?",
      "If you need to change a bandage or clean a cut, where do you find clean supplies—first-aid kit, bathroom cabinet, or ask an adult?",
      "How do you practice safe use of scissors, knives, or other sharp tools—hold them away from your body, cut on a stable surface, or follow adult instructions?",
      "What’s your strategy for catching the school bus safely—stand back from the road, wait until it stops fully, and board calmly?",
      "If an unfamiliar app asks for permission to use your location or camera, how do you decide whether to allow it—ask a parent, read the privacy info, or decline?",
      "How do you make sure you get enough rest each night—set a bedtime, avoid screens before bed, or follow a bedtime routine?",
      "What would you do if you found a fire extinguisher at home—learn how to use it, keep clear instructions nearby, or show an adult?",
      "How do you prepare for a field trip—pack water, wear comfortable shoes, and know whom to contact if you get lost?",
      "What do you do if someone you trust asks you to keep a secret that makes you uncomfortable—talk to another trusted adult, refuse, or explain why?",
      "If there’s a power outage at night, how would you stay safe—use a flashlight, stay calm, or find your family members?",
      "How do you practice personal hygiene to stay healthy—wash hands before meals, brush teeth after eating, or bathe regularly?",
      "What do you do if you see someone on the playground doing something dangerous—yell stop, inform an adult, or safely intervene?"
    ],
    "follow_up_questions": [
      "What made you think of that?",
      "Can you walk me through exactly what you’d do first?",
      "How did you feel when that happened (or when you imagined it)?",
      "Why is that rule or tip important to you?",
      "What sounds, sights, or smells do you notice in that situation?",
      "Who else would be around, and what would they do?",
      "If you could change one thing to make it safer, what would it be?",
      "What questions do you still have about handling that?",
      "How did you learn that rule—who taught it to you?",
      "What’s one mistake someone might make, and how would you correct it?",
      "How long do you think it takes to get help in that scenario?",
      "What supplies do you wish you had if it got worse?",
      "How would you stay calm while you wait for help?",
      "Who would you trust most to support you, and why?",
      "What would you say to a friend who didn’t believe it could be dangerous?",
      "How has your approach changed since you first learned about it?",
      "What surprises you about how other kids handle the same situation?",
      "What’s the hardest part about doing that the right way?",
      "If you taught a younger kid, what key steps would you show them?",
      "Is there anything else about staying safe that you think is important?"
    ]
  },
  "Financial & Civic Responsibility": {
    "questions": [
      "How do you earn money or allowance—what chores, tasks, or occasions give you coins or dollars?",
      "When you get money, what do you usually choose to spend it on first, and why?",
      "Can you tell me about something you really wanted and saved up for—what steps did you take?",
      "What rules or habits does your family have about sharing, saving, or spending money?",
      "Describe a time you decided to spend your money versus save it—what helped you decide?",
      "Have you ever given money, toys, or time to help someone else—what did you do and how did it feel?",
      "What volunteer work or community service have you done—like helping at a food drive or cleaning up a park?",
      "Are there any local events or neighborhood projects you’ve helped organize or take part in? Tell me about one.",
      "How do you and your family practice recycling, composting, or conserving water and electricity at home?",
      "Can you share a story of exploring nature—like a hike or beach cleanup—and how you helped protect it?",
      "What is your experience with setting a small budget—how did you decide what to buy and how much to save?",
      "Have you ever made a gift for someone using things you already had—what did you create and how did it make them feel?",
      "What’s a skill you could teach others in exchange for a small payment or prize—how would you advertise it?",
      "If you found a dollar bill on the ground, what would you do with it—save it, spend it, or give it away?",
      "When you borrow something from a friend, how do you make sure you return it in good condition?",
      "How do you decide when to ask for help if you don’t have enough money—do you talk to parents, find a way to earn more, or change your plan?",
      "What’s a financial goal you have for next month—maybe saving for a toy or donating to a cause—and how will you track it?",
      "How do you teach younger siblings or friends about saving money—do you share tips, play games, or show them your piggy bank?",
      "Have you ever started a small business—like a lemonade stand or craft sale—what did you learn from the experience?",
      "What does it mean to pay taxes—have you heard your parents talk about it, and why do people pay taxes?",
      "How do you compare prices when you want to buy something—check stickers, ask a parent, or search online?",
      "If you had to plan a class fundraiser, what cause would you choose and how would you organize it?",
      "What’s your understanding of a charity—how do you pick one to support, and what question do you ask before donating?",
      "Can you explain how a bank or piggy bank helps you keep your money safe—what are the benefits?",
      "If you wanted to buy something expensive, how would you negotiate a payment plan—ask parents, offer extra chores, or find a smaller version?",
      "When you go shopping with family, how do you decide to compare prices on similar items—look at quality, brand, or cost?",
      "How do you track money you’ve already spent versus money you still have—use a chart, jar system, or mental math?",
      "If you win a small prize—gift card, game token—how do you decide whether to use it immediately or save it?",
      "What do you think a fair wage is for someone doing a simple job—walking a dog or mowing a lawn—and how did you come up with that amount?",
      "When you work in a group project at school, how do you share responsibilities and credits fairly among team members?",
      "If you could run for a class office, what platform or ideas would you present, and why do you think people would vote for you?",
      "How do you handle peer pressure to spend money on things you don’t need—like snacks or toys—at school or in your neighborhood?",
      "What’s a way you could help your local library or community center—organize a book drive, volunteer, or make posters?",
      "If you see litter on the street, what steps do you take—pick it up, report it, or start a cleanup with friends?",
      "How do you involve younger siblings or friends in environmental stewardship—teach them recycling, plant a seed, or pick up trash together?",
      "What’s a time you noticed a problem in your neighborhood—like graffiti or broken benches—and how could you help fix it?",
      "How do you weigh the decision between buying something for fun and saving for something more important—list pros and cons or talk it over?",
      "What have you learned about borrowing and lending money—how do you make sure everyone feels comfortable and treated fairly?",
      "When you join a club or team that charges dues, how do you plan to pay your share, and what do you expect in return?",
      "If you wanted to design a coin or bill for your own imaginary country, what image or symbol would you choose, and why?",
      "How do you decide which community events to attend—school fundraisers, volunteer fairs, or sports games—and what makes you pick one?",
      "What is an example of a time you felt pride in contributing to a group—helping a neighbor, sharing supplies, or teaching a skill?",
      "If your classmates asked you to organize a charity bake sale, what items would you bake and how would you price them?",
      "What’s a way you can help reduce waste at home—use reusable water bottles, pack snacks in reusable bags, or turn off lights when not needed?",
      "How would you encourage friends to donate old clothes or toys they no longer use—talk about benefits, share examples, or set a group challenge?",
      "If you had a small allowance and wanted to split it three ways—for saving, spending, and giving—how much would you allocate to each?",
      "How do you decide which charity to give to during holidays—look at causes, talk to family, or choose something you care about?",
      "What’s a community service project you think your school or neighborhood needs—organize a book drive, fix a playground, or paint a mural?",
      "How do you learn about money from family traditions—gift-giving during holidays, red envelopes, or special savings rituals?",
      "If you found someone’s lost wallet with a small amount of money, what would you do—try to return it, donate it, or something else?",
      "How do you approach asking parents for more allowance—show responsibility, present a plan, or offer to do extra chores?",
      "When you receive a gift card, how do you decide what to buy—look for sale items, save for something bigger, or share with a friend?",
      "What is a way you practice gratitude for what you have—write a thank-you note, donate to others, or share your success story?",
      "If you had to explain the concept of supply and demand to a friend, what simple example would you use—lemonade stand, toy in short supply, or popular snack?",
      "How do you involve friends in environmental conservation—organize a bike-to-school day, start a recycling contest, or plant flowers together?"
    ],
    "follow_up_questions": [
      "What inspired you to make that choice?",
      "Why was that important to you?",
      "How did you feel when you first tried it?",
      "What steps did you follow, exactly?",
      "Who helped or joined you, if anyone?",
      "What challenges did you face along the way?",
      "How did you decide on your goal or plan?",
      "What surprised you most about the outcome?",
      "How long did it take from start to finish?",
      "What did you learn from doing that?",
      "How did others react when they saw you do it?",
      "If you could do it again, what would you change?",
      "What sounds, sights, or smells do you remember?",
      "How do you track your progress or savings?",
      "What advice would you give a friend trying the same thing?",
      "How has your approach changed since last time?",
      "What tools or supplies did you need?",
      "How did you stay motivated when it got hard?",
      "What does success look like for you in this?",
      "Is there anything else about this experience you’d like to share?"
    ]
  }
}
