{
    "Profile": {
        "questions": [
            "You were born on December 25, 2016 — what do your parents tell you about how they chose your birthdate and how you celebrate it each year?",
            "Your birthplace is listed as West Middlesex University Hospital, west of Kew — what do you know about that hospital or that part of town?",
            "Your Chinese zodiac is Monkey — how do you feel your personality connects to Monkey traits?",
            "Your Western zodiac is Capricorn — have you ever read about Capricorns, and do you think those descriptions fit you?",
            "Your blood type is O — have you ever discussed with your family how blood types matter, and do you know any stories about Type O?",
            "You attend Belsize St. George Primary School — what makes your school special compared to other schools you’ve visited?",
            "Your communication style is outgoing and factual — can you give an example of a time when being factual helped you solve a problem?",
            "You use kind words sincerely — how do you decide exactly what “sincere” words to say, and can you remember a time when choosing the right words changed someone’s day?",
            "You describe yourself as expressive in communication — how do you know when you have expressed your thoughts clearly?",
            "You say you’re kind and sensitive — can you share a situation where your sensitivity to others’ feelings helped a friend?",
            "You mention that you’re encouraging to people — what strategies do you use to encourage someone who’s feeling down?",
            "You’re observant and curious — what’s the most recent small detail you noticed that others missed?",
            "You describe yourself as imaginative — can you recall a time when your imagination led you to create something new?",
            "You say you think and describe things independently — how do you keep your own ideas from getting influenced by what classmates say?",
            "You identify as calm and rational — how do you maintain that calm in a chaotic or exciting moment?",
            "You consider yourself meticulous and serious — what’s a project you worked on that demanded extreme attention to detail?",
            "You have strong self-esteem but are sensitive to criticism — how do you balance pride in your abilities with the sting of negative feedback?",
            "You say you care about others’ opinions of you — how do you decide whose opinion matters most, and why?",
            "You believe you have maturity beyond your age — can you tell me about a situation where you felt your response was more mature than those of your peers?",
            "You enjoy adult conversation — what was the most interesting topic you discussed recently with an adult?",
            "You describe yourself as confident and self-reliant — when have you had to solve a problem on your own, without asking for help?",
            "You say you are logical and precise, and you correct others when they’re wrong — how do you make sure you correct someone kindly rather than sounding bossy?",
            "You express emotions but aren’t moody, and you talk to your mother — what does your mother do that helps you open up?",
            "You like planning and making deliberate decisions — what’s a recent decision you planned out carefully, and what was the result?",
            "You value honesty and generosity — can you think of a time when you chose generosity even when it was hard?",
            "You love Lucienne but feel slight jealousy sometimes — what is it that Lucienne does that makes you feel that way, and how do you cope?",
            "You respect girls and feel awkward around romance — what happens when you try to talk to a girl or give a compliment?",
            "At home, you have freedom of expression — what’s the one idea you feel most comfortable sharing at home but not at school?",
            "Your family encourages questions — what’s the boldest question you’ve ever asked during dinner?",
            "Your chores include making breakfast, preparing a picnic, tidying your room, folding laundry, and sometimes helping Dad wash the car — which chore do you secretly enjoy the most and why?",
            "Your school performance is upper-middle — what’s one subject you think you can push into top-tier next term?",
            "You like self-study and read more than your peers — what book or topic did you finish on your own recently that surprised you?",
            "Your favorite subject is natural science, and you have strong math intuition — how do you combine those strengths when tackling a new science problem?",
            "You love art and use it to express emotions, influenced by your uncle — who in your uncle’s work inspired you, and how did you try to emulate it?",
            "Your physical ability is average, you prefer hiking, and your PE performance is slightly above average — what aspect of hiking makes it your go-to sport?",
            "You say you have no musical talent but feel music deeply and dance at home — which song moves you most, and how do you interpret it through dance?",
            "You love nature and have hands-on skills like kite making, science experiments, and cooking — what was the last hands-on project you tackled, and what did you learn?",
            "You’re learning Chinese, French, Spanish, and Japanese — which language do you find most challenging, and what tricks do you use to practice it?",
            "You spend weekends on art — what was the latest piece you created, and what does it represent?",
            "Your career dreams include naturalist, astronaut, rocket designer, and chef — which of these four excites you most today, and what step could you take next to move toward it?",
            "Your weekend gear includes binoculars, magnifier, notebook, and 24-color pencils — what’s the most memorable observation you’ve made using that gear?",
            "Your book collection covers taxonomy, stories, astronomy, geography, and cooking — which cookbook from your shelf did you most recently try to follow, and what was the result?",
            "You describe your diet as picky but loving organic food — what’s one organic dish you insist on having, and why can’t you do without it?",
            "You say you like planning but struggle to follow strictly — can you share an example when your plan fell apart and how you adapted?",
            "Your favorite colors are blue, green, and purple — how do you use those colors in your clothes, room décor, or artwork?",
            "Your favorite foods include whole wheat toast with marmalade, masala curry chicken, scone with Devonshire cream, lamb soup, and 85%+ dark chocolate — which of these tastes the most like comfort food to you, and why?",
            "You’re most curious about craft beer — what fascinates you about craft beer, and how did you first learn about it?",
            "Your least favorite foods are fish and chips, and artificial strawberry flavor — what was the worst experience that made you decide you didn’t like them?",
            "Your role models include Paddington Bear and Hedwig among fictional heroes, and Sir Isaac Newton, Albert Einstein, Charles Darwin, E.O. Wilson, Jane Goodall, David Attenborough, Roger Penrose, and Kip Thorne among real heroes — which one of these role models have you tried to emulate recently, and how?",
            "You feel insecure about your height and lack of sports talent — how do you handle those insecurities when you see a tall friend or a skilled athlete?"
        ]
    },
    "Family": {
        "questions": [
            "How do you feel your birthdate (December 25) influences holiday celebrations and family gatherings?",
            "What qualities do you share with other Monkeys in your Chinese zodiac, and how do you see them in yourself?",
            "As a Capricorn, what responsibilities or goals do you set for yourself each year?",
            "What’s your earliest memory of a family tradition, and how does it still make you feel when you think about it?",
            "How do you share your achievements or discoveries with your parents—do you show them worksheets, drawings, or talk in person?",
            "When you and Luthien play together, what roles do you each take, and how do you look out for her safety or happiness?",
            "How do you decide which aspects of your personality to highlight when you’re with grandparents versus when you’re with friends?",
            "In what ways do you try to balance being “above your age” with still wanting to enjoy childlike fun?",
            "What is your favorite activity to do together with Luthien, and how do you help her when she needs it?",
            "How do you and Luthien handle disagreements, and what do you usually do to make up afterward?",
            "What is something new you have taught Luthien this year, and how did she react?",
            "What is Luthien’s favorite game to play with you, and how do you teach her new rules or introduce her to new activities?",
            "How do you comfort Luthien when she’s upset or frightened, and can you recall a specific time you helped calm her?",
            "What is something Luthien does that never fails to make you laugh, and how do you both share those moments with your parents?",
            "How do you and Luthien celebrate her birthday together, and what special role do you like to play in planning her party?",
            "What is one important lesson you’ve taught Luthien, and how did you figure out the best way to explain it to a younger child?",
            "What is something Luthien does that always makes you proud, and how do you encourage her to keep improving?",
            "How do you handle moments when you and Luthien want the same toy or privilege—what compromises have you learned?",
            "What is a creative idea you and Luthien came up with together to solve a problem at home?",
            "When Luthien is learning something new, how do you support her practice, and what do you learn in the process?",
            "How do you feel when you see Luthien achieve something for the first time, and how do you celebrate with her?",
            "How does your father’s work as a secondary school language teacher influence the way he helps you with homework?",
            "What did your father share about growing up in 1984 that you find interesting or surprising?",
            "How does your father’s background in languages inspire you to learn Chinese, French, Spanish, and Japanese?",
            "What language or cultural story has your father shared from his classroom that inspired you to explore other cultures?",
            "How does your father balance being a teacher and a parent—what advice does he give you about studying or managing your time?",
            "What’s a memorable trip you took with your father, and what did you learn about the world from his perspective?",
            "How do you and your father discuss your future goals—does he offer suggestions for subjects you might excel in?",
            "What is your father’s proudest moment related to you or your sister, and how did he celebrate it with the family?",
            "What is one piece of advice your father gave you that you still think about every day, and why does it resonate?",
            "How does your father involve you in his teaching or lesson planning, and what have you learned from that experience?",
            "When your father is preparing for a school event or parent–teacher meeting, how do you help him get ready?",
            "What is a story your father has shared about his own childhood that made you see him differently?",
            "How do you and your father decide on family rules—do you ever suggest changes, and how does he respond?",
            "What medical or health tip has your mother taught you that you now use in your daily habits—like hand-washing or checking for fever?",
            "How do you and your mother bond over storytelling—does she share any favorite patient anecdotes or family stories at bedtime?",
            "What’s a time you accompanied your mother during her rounds at the community hospital, and what did you observe about her work?",
            "How does your mother encourage you when you feel sensitive to criticism, and what comforting words does she use when you’re upset?",
            "What is one recipe or comfort food you learned to make with your mother, and why is it special to you both?",
            "How does Dr. Kate Newton’s work as a general practitioner shape your understanding of health and medicine at home?",
            "What advice has your mother given you about being sensitive to others’ feelings, based on her experience caring for patients?",
            "How do you and your mother celebrate her birthdays and milestones, given her busy schedule at the community hospital?",
            "What has your mother taught you about kindness through her work as a doctor, and how do you show kindness to others?",
            "How do you comfort your mother when she’s had a challenging day at the hospital, and what does she say to make you feel better?",
            "When your mother shares medical knowledge—like why it’s important to wash hands—what experiments or demonstrations do you do together?",
            "What is a time you helped your mother with a work-related project or household task, and how did it change your perception of her job?",
            "How do you and your mother plan special mother–child activities, and what do you look forward to doing with her most?",
            "What stories has George Patrick Newton shared about his role as a government official, and what did you learn from them?",
            "How did your grandfather’s upbringing in 1955 differ from your childhood, and what lessons did he pass on to you?",
            "What qualities of leadership or responsibility do you admire most in your paternal grandfather?",
            "What traditions does Grace Newton maintain from her family, and how do you help her with household tasks?",
            "How does your grandmother’s experience as a housewife influence the way she supports your family’s daily routine?",
            "What have you learned from your grandmother’s stories about life growing up in 1960?",
            "What lessons has William Lucas Smith taught you about problem-solving from his work as an automotive technical consultant?",
            "How does your maternal grandfather’s experience working with cars inspire you to tinker or experiment with science projects?",
            "What family stories did your grandfather share about his childhood in 1960 that made you curious about the past?",
            "How does Mary Smith’s role as an office clerk influence the way you organize your own tasks and routines?",
            "What advice has your grandmother given about balancing work and family life, and how do you apply it to your chores?",
            "What cultural or family traditions does Mary Smith preserve from her childhood in 1960, and how do you participate?",
            "How did Uncle Ian’s Finance/AI career spark your interest in technology or money management?",
            "What lessons did you learn from Uncle Ian about balancing work in finance with raising Alex and caring for Duke the Labrador?",
            "How has spending time with Uncle Ian and Angela influenced your understanding of team sports through her coaching?",
            "What discoveries or missions from Irene’s marine biology career have fascinated you most, and why?",
            "How do you and Aunt Irene bond over science—do you join her on beach cleanups or lab visits?",
            "What has Alek (Irene’s spouse Vivek Singh) taught you about the brain and neuroscience when you visit their lab?",
            "How did Irvin’s work as an artist influence your own drawing or painting style, and what lessons did you pick up?",
            "What stories has Irvin shared about collaborating with his partner Samira on illustration projects?",
            "How do you and Uncle Irvin explore creativity together—have you ever joined him in a studio session?",
            "What games or projects do you enjoy doing with Alex, and what have you taught him about storytelling or science?",
            "How did Alex react when he first met Duke the Labrador, and how do you help him care for their pet together?",
            "What have you learned from Aunt Angela’s experience coaching high school football that applies to teamwork in your life?",
            "How does Angela’s American background influence the way she and Uncle Ian celebrate holidays with the family?",
            "What interesting facts about the brain has Dr. Vivek Singh shared that made you curious to learn more?",
            "How do you and Vivek work together on science experiments—has he ever helped you design one at home?",
            "What techniques has Samira taught you about illustration or digital art that you’ve used in your own artwork?",
            "How do you and Samira collaborate when creating a piece—does she let you pick colors or sketch ideas?",
            "What gardening projects have you and Aunt Audrey done together, and what lessons did you learn about plants?",
            "How do Audrey’s pets provide companionship, and have you helped her care for any of her five cats?",
            "What have you learned from Jason (Audrey’s partner) about coding and software engineering in your daily routines?",
            "What coding or technology project did Jason help you with, and how did it spark your interest in programming?",
            "How do you and Jason explore cultural traditions together, given his Chinese heritage and family customs?",
            "What recipes has Edward the chef taught you to prepare, and how did you help him in the kitchen?",
            "How does Edward’s hometown of Manchester influence the way he cooks British dishes for your family?",
            "How has Diana’s career as a YouTube fashion blogger influenced your own sense of style or creativity?",
            "What tips have you picked up from Diana’s videos about presenting yourself on camera or telling a story?",
            "What have you learned from Daniele’s studies at Central Saint Martins about fashion design or trends?",
            "How does Daniele’s Italian background influence the way they and Aunt Diana celebrate family events?",
            "What stories did Philip S. Newton share about growing up between 1928 and 2009 that taught you about history?",
            "How has hearing about Philip’s life experiences influenced your own sense of family tradition?",
            "What did Isabella Newton’s generation teach your grandparents that they passed down to you?",
            "Are there any heirlooms or keepsakes from Isabella that you’ve seen and asked about?",
            "What stories did Sean O’Connor share from his life between 1938 and 2001, and how did they shape your family’s values?",
            "How do your parents honor Sean’s memory in your daily life or family traditions?",
            "What did Great-Grandma Orla’s clairvoyant heritage teach you about imagination and dreams?",
            "How did Orla’s upbringing in rural Ireland influence your sense of connection to nature?",
            "What stories did Lucas Smith tell about life in the 1920s and 1930s, and how do they compare to your own childhood?",
            "How do your parents describe the lessons they learned from Lucas, and have any of those lessons stuck with you?",
            "What did Ethel Smith’s life between 1930 and 1998 teach your family about resilience or community?",
            "Have you seen any photographs of Ethel as a child, and what questions did you ask about her life?",
            "What stories did John Bush share about his era, and how does knowing his lifespan (1925–2001) help you understand history better?",
            "Do you have any family heirlooms or letters that belonged to John Bush, and what did you learn from them?",
            "What memories do your parents share about Kate Bush’s life around 1929–2002, and how do those stories inspire you?",
            "Are there any traditions or recipes passed down from Great-Grandma Kate that you still enjoy today?",
            "What is your favorite thing to observe about your guppies and angelfish, and how do you care for their tank?",
            "How did you learn to maintain water quality for the fish, and what challenges have you encountered?",
            "What is Colonel Rock’s favorite type of food, and how did you come up with his name?",
            "How do you make sure Colonel Rock’s environment mimics his native Brazil, and what have you noticed about his behavior?",
            "What differences have you observed between Leopard and Cleopatra in their behaviors or favorite foods?",
            "How did you choose their names, and what do they teach you about responsibility when caring for reptiles?",
            "How did you and your family cope when Peter was killed by a predator, and how did you help Cotton-tail adjust afterward?",
            "What is Cotton-tail’s favorite treat, and how do you and your family bond over caring for her?",
            "How did Pikachu, Psyduck, Peanut, and Pine nut each develop their unique personalities, and what do you enjoy most about them?",
            "What challenges do you face in caring for multiple parakeets and chicks, and how do you keep them healthy?",
            "What is your favorite memory of receiving the rainbow stag beetle from Gerald, and how did you name it?",
            "How do you care for your collection of flower beetles, rhinoceros beetles, ground beetles, and the giraffe stag beetle?"
        ]
    },
    "Kids and People" : {
        "questions": [
            "How do you and Luthien decide together which princess stories to read or dress-up for when she wants to be a princess?",
            "When Luthien feels emotional or expressive, how do you comfort her and help her understand her feelings?",
            "What games or activities do you play with Luthien that help her burn off her energy when she wants to sprint around?",
            "When Gerald is disruptive in class, what do you do to help him focus and still be creative?",
            "Which sport do you and Gerald like to play together, and how does he help you when you’re building or drawing something?",
            "How do you and Gerald decide what to eat when he wants pizza or chicken wings—do you ever cook together at home?",
            "What’s a time you and Gerald stayed after school to build or create something together, and how did you decide what to make?",
            "How do you and Gerald support each other when one of you is nervous—like before a class presentation or a sports game?",
            "When Gerald comes up with an impulsive idea, how do you balance his creativity with making sure things stay safe?",
            "What’s Gerald’s favorite way to cheer you up when you’re feeling down, and how did that first happen?",
            "How do you settle disagreements with Gerald when you both want to lead a project or choose the rules of a game?",
            "What’s the funniest prank you and Gerald have ever pulled together, and how did your classmates react?",
            "How do you and Gerald set goals for yourselves—like learning a new skill or improving at a sport—and how do you track progress?",
            "When Gerald is being disruptive in class, what do you say or do to help him focus without getting in trouble?",
            "What’s one thing Gerald has taught you about being bold or taking risks, and how did you apply it to something you tried afterward?",
            "How do you and Gerald plan your weekends—what do you usually agree on, and what do you compromise on?",
            "What’s the most memorable impromptu performance John has given, and how did you and your family react?",
            "How do you and John compare your experiences of being new to a household—what advice do you give him when he’s missing home?",
            "What’s a favorite geography fact John taught you, and how did that spark your curiosity to learn more about that place?",
            "When John feels clumsy or makes a mistake, how do you encourage him to keep trying and not feel embarrassed?",
            "How do you and John celebrate successes—like finishing a project or winning a game—so you both feel proud?",
            "What’s a time you and John stayed up late talking about your dreams or goals, and how did that conversation change your friendship?",
            "How do you help John practice English or other subjects when he struggles, and what “teaching tricks” do you use to help him learn?",
            "When John misses his family, what activities or foods do you share to help him feel more at home?",
            "What’s the biggest surprise you’ve seen from John’s hidden talents—like a song he wrote or a trick he performed?",
            "How do you and John decide on chores or responsibilities at home—like who does which task and when?",
            "What’s the funniest impersonation John has done recently, and how did you react when he sang for you?",
            "When John gets homesick, what do you do to cheer him up, especially when he’s missing Xi’an food or family back in China?",
            "Have you ever explored a geography project together, and what did you learn about a place you both found interesting?",
            "What kind of imaginary flower did Maeve create with yarn last, and how did you help her bring that idea to life?",
            "When Maeve shares her dreams with you, what was the most surprising dream she described, and how did you respond?",
            "Which art project have you and Maeve worked on together, and how did her quiet, dreamy nature influence the final piece?",
            "What’s the most imaginative story Maeve has shared about her yarn flowers, and how did you help turn it into a craft project?",
            "How do you and Maeve practice drawing or painting together—what tools or materials do you choose, and why?",
            "When Maeve feels shy about showing her art, what do you say or do to help her gain confidence?",
            "What’s a dream Maeve described that really surprised you, and how did it change your own view of imagination?",
            "How do you and Maeve decide which art supplies to use when crafting—do you plan together or let each other choose freely?",
            "What’s the longest art project you and Maeve have worked on over a weekend, and how did you keep each other motivated?",
            "When Maeve invents a new imaginary flower, how do you and she assign its colors, shape, and name together?",
            "How do you comfort Maeve if she’s frustrated during a creative block—what strategies help her find inspiration again?",
            "What’s a favorite place you and Maeve go to draw or create—like a quiet park bench or a sunny window spot—and why is it special?",
            "How do you and Maeve share and celebrate each other’s art—do you hold mini “exhibitions,” give compliments, or frame your favorite pieces?",
            "After Sophie’s accident, what reflections did she share with you about safety or taking care of yourself?",
            "How do you and Sophie bond as equals when she babysits you—what stories or games do you enjoy together?",
            "What’s the most interesting thing Sophie has taught you about psychology so far, and how did you apply it when talking about your feelings?",
            "How do you and Leslie challenge each other in math or kite flying, and what was the hardest kite design you both tried?",
            "When you work on homework together, what tips does Leslie give you to excel at math while still having fun?",
            "How do you and Leslie balance being studious but still friendly—what activities do you enjoy outside of class?",
            "What’s the best game you and Alex have played together when he visits, and how do you teach him to follow the rules?",
            "When Alex first learned to skateboard or ride a bike, how did you help him feel confident and safe?",
            "What stories does Alex like to hear about your family’s history, and how do you explain older relatives to him?",
            "What games do you and Margo play when Luthien invites her over, and how do you all decide on which activity to try next?",
            "How does Margo react when Luthien pushes her—what do you say to help both of them stay friends afterward?",
            "What’s something funny Margo said or did during your last playdate, and how did everyone laugh together?",
            "When James visits, how do you and Gerald’s older brother decide which sport to play, and what makes it fun for both of you?",
            "What advice has James given you about school or sports, and how do you put that advice into action during your games?",
            "How do you and James handle disagreements when you both want to use the same video game or toy?",
            "What is Henry’s favorite toy or game when he visits, and how do you help him feel included when he’s younger?",
            "How do you keep Henry entertained when your mom’s friend brings him over, especially since he’s just a toddler?",
            "What funny thing did Henry do last time he was here that made everyone smile?",
            "What do you and Hal do when he visits—do you play outdoor games or show him your favorite backyard spots?",
            "How do you teach Hal about taking turns and sharing when you both want to play with the same toy?",
            "What’s something Hal said or asked that surprised you, and how did you answer him?",
            "What animals do you and David like to watch together at the zoo, and what facts did you learn from him about those creatures?",
            "How does David help you feed or care for zoo animals during your visits, and what did you discover about their habitats?",
            "What game or activity do you and David enjoy doing after visiting the animals, and how did that become a tradition?",
            "How does Julie’s height help her in games like basketball or reaching things on high shelves, and do you ever ask her for help?",
            "Has Julie ever taught you a trick for staying tall and confident when playing with classmates?",
            "How do you help Colin when his allergies flare up—do you remind him to take medication or find a shady spot to rest?",
            "What is Colin’s favorite place to play outside, and how do you both avoid triggers for his seasonal allergies?",
            "Why do you think Kirk sometimes acts like a bully, and have you found any way to talk to him and understand what’s bothering him?",
            "What do you do when Kirk picks on someone—how do you stand up for that classmate and keep everyone safe?",
            "What makes Amanda stand out in cooking class, and why do you think you like her as a friend or partner in cooking?",
            "Have you ever helped Amanda choose ingredients or recipes, and how did she teach you something new about cooking?",
            "What challenges do you and Jenny face when cooking together, and what’s your favorite dish that you’ve both made?",
            "How do you and Jenny decide who does which task in cooking class—do you prefer stirring or chopping, and what does she prefer?",
            "What’s a memorable recipe you and Andy created together, and how did Andy react when the dish turned out well (or didn’t)?",
            "How do you handle mistakes in cooking class when you and Andy mix up ingredients—what did you learn from that experience?",
            "What tips has Rosa given you about improving your tennis or sports skills, and how did you practice them together on court?",
            "How do you feel watching Rosa play at junior Wimbledon, and have you tried any of her training exercises at home?",
            "What games do Jeffery and Luthien love to play together, and how do you help them settle when they disagree?",
            "How do you encourage Jeffery when he’s shy or hesitant, since he’s Luthien’s best friend?",
            "What happened when Luthien pushed Chris, and how did you help them make up afterward?",
            "How do you and Chris make sure everyone understands each other’s feelings so that pushing doesn’t happen again?",
            "What was your favorite lesson from Year 1 with Mr. Andrew, and how did he make learning fun?",
            "How did Mr. Andrew handle times when you felt sensitive to criticism, and what did he do to help you feel more confident?",
            "What activities did Mr. Jacob introduce in Year 2 that made you curious about new subjects?",
            "How did Mr. Jacob help you when you had trouble understanding something, and what did you learn most from him?",
            "What was Aki’s favorite part of Gerald’s birthday party, and how did you and Aki play together?",
            "How do you and Aki bond over shared interests, like drawing or toys, when you meet at Gerald’s house?",
            "What did you and Batul do together at the Nadam festival, and how did you learn about Mongolian culture from him?",
            "How do you and Batul stay in touch or play together after meeting briefly at the festival?"
        ]
    },
    "Schedule": {
        "questions": [
            "What makes Belsize St. George Primary School different from other schools you’ve heard about?",
            "How does the 4–11 age range influence classroom activities, and what do you enjoy most about that grouping?",
            "What subjects or projects do you most look forward to in Key Stage 1, and why?",
            "How does learning in Key Stage 2 build on what you did earlier, and which new challenges excite you?",
            "During Art Week, what is your favorite medium to work with—paints, clay, or something else—and why?",
            "Can you describe a memorable project you created during last Art Week and what inspired it?",
            "What was the most impressive exhibition or performance you saw on campus, and how did it make you feel?",
            "Have you ever participated in one of those performances? If so, what role did you have and how did you prepare?",
            "Which cuisine stood out most to you at the International food market, and did you try any new dishes?",
            "How did you help with the International food market—cooking, serving, or telling guests about the dishes?",
            "How does having equal display space for students and teachers encourage you to share your work more confidently?",
            "What piece of your work did you find most rewarding to display alongside your teachers’ creations, and why?",
            "How do you celebrate the New Year Holiday with your family, and what traditions do you enjoy most?",
            "Do you watch the Australian Open at home? If so, which match or player did you find most exciting this year?",
            "What do you usually do during the Half-term break—travel, visit friends, or try a new activity?",
            "Which book do you dress up as or talk about on World Book Day, and why is it special to you?",
            "How do you celebrate St Patrick’s Day—do you wear something green, learn about Irish culture, or join a parade?",
            "What do you do to show appreciation on Mothering Sunday, and what gift or gesture makes your mother happiest?",
            "What is your favorite activity or trip during the Easter Holidays, and how do you keep entertained for nearly three weeks?",
            "Does your family have any special traditions for Good Friday—quiet reflection, cooking certain foods, or attending a service?",
            "What is your favorite part of Easter Sunday—egg hunts, family meals, or attending a celebration?",
            "How do you learn about St George’s Day at school—stories, plays, or assemblies—and what do you find most interesting?",
            "How do you spend the Early May Bank Holiday—family picnic, local festival, or just relaxing at home?",
            "What special event or outing do you and your family plan for the Spring Bank Holiday each year?",
            "Do you follow the French Open tennis tournament? If so, which player’s style do you admire most and why?",
            "What do you enjoy doing with your father on Father’s Day, and what gift did you choose for him this year?",
            "Have you ever watched Wimbledon live or on TV? Which match or competitor left the biggest impression on you?",
            "What is your favorite way to start the Summer Holidays—special trip, sleep-ins, or spending time with friends?",
            "What memory stands out from your Devon vacation this July, and what new experience did you have there?",
            "How do you and your family celebrate the Summer Bank Holiday—BBQ, day trip, or visiting relatives?",
            "When you watch the US Open at home, which aspect of the tournament—score keeping, player styles, or fashion—interests you most?",
            "What are you most looking forward to at the start of the Autumn Term—new subjects, catching up with classmates, or extracurriculars?",
            "Do you have any special plans for the October Half-term break, such as a short trip or a fun project at home?",
            "How does your school commemorate Remembrance Sunday, and what do you learn about its significance?",
            "Have you learned anything about Scottish heritage for St Andrew’s Day, and how do you celebrate or honor it?",
            "What is your favorite memory from last Christmas Holidays, and how do you plan to make new memories this year?",
            "How does your family celebrate Christmas Day and Boxing Day—special meals, gifts, or visiting relatives?",
            "When Dad takes you and Luthien to your paternal grandparents’ house, what do you look forward to doing in the suburbs?",
            "How do you spend Sundays with Dad while Mom works and takes Luthien—do you have a special activity or treat together?",
            "What does Dad like to do when he spends Saturday alone, and how do you look forward to hearing about it on Sunday?",
            "How do Mom and Dad plan their date day, and what is your favorite memory of picking up the kids from your maternal grandparents?",
            "What game or project do you enjoy doing with Dad and Luthien when Mom works on week 3 Saturdays?",
            "When Mom takes Luthien and you stay with Dad, what is your favorite activity to share with him on those Sundays?",
            "What is your favorite dish at the end-of-month Sunday roast with maternal grandparents, and who usually carves the meat?",
            "Which subject do you find most engaging on Mondays, and how does PSHE help you at the end of the day?",
            "How do you feel switching from DT to DT in the last two periods—what kinds of design tasks do you enjoy most?",
            "What do you like most about swimming on Wednesdays, and how do you prepare yourself for those sessions?",
            "How do you balance studying Religion and PE on Thursdays, and which one energizes you more?",
            "What drama activity do you look forward to on Fridays, and how does it help you wind down before the weekend?",
            "How did you enjoy the campus-wide Art Gallery Visit on Tuesdays in Version 2, and what was your favorite piece?",
            "What was memorable about the Art Gallery Visit compared to regular Computer or Science lessons?",
            "How does studying Music on Wednesdays affect your mood for the PE session afterward?",
            "What project did you create during Photography (or Music) class on Thursdays, and who helped you the most?",
            "What do you enjoy drawing or painting during the Painting/Sculpture periods on Fridays, and how do you display your finished work?",
            "What is the first thought that crosses your mind when your alarm sounds at 7:00?",
            "How do you decide what to have for breakfast, and who helps you prepare it during this time?",
            "During the time you wash, eat, dress, and pack, what part do you enjoy most, and what helps you stay on schedule?",
            "What do you and Dad talk about as you walk to school, and how does that help you start your day?",
            "Which part of your daily classes—Language, History, Geography, or Science—do you find most challenging, and why?",
            "How do you feel when school ends at 15:40, and what is the first thing you look forward to doing afterward?",
            "What topics do you and Dad discuss over tea at the café, and how does that one-on-one time benefit you?",
            "What do you like most about afternoon tea at school, and who do you sit with when you have it?",
            "How does having tea at home with Sophie on Fridays compare to having tea during the week at school?",
            "Which extracurricular activity—cooking, arts & crafts, or movie—do you choose most often, and what is your favorite memory from that session?",
            "When Mom or Dad picks you up at 17:30, what do you usually chat about on the way home?",
            "How do you help with dinner preparation at home, and what dish do you enjoy making most?",
            "How does Mom’s arrival home change the atmosphere in the house, and what do you like to share with her first?",
            "What makes Friday takeout night special, and how do you decide which restaurant or cuisine to order?",
            "During your personal time, what activity relaxes you the most—reading, drawing, or playing a game—and why?",
            "What steps do you follow to wash up and prepare for bed, and do you have a favorite bedtime story or routine?",
            "What do you dream about when you fall asleep each night, and how do those dreams influence your next day?"
        ]
    }
}
