{
  "Core Identity": {
    "questions": [
      "What’s your full name, and do you know why your parents chose it for you?",
      "How does it feel to be nine years old—what’s the best thing about this age?",
      "When you think about being a boy (or girl), what does that mean to you?",
      "If you could pick three words that describe your personality, which would you choose and why?",
      "Can you tell me about a time you felt really shy (or really energetic)? What was happening?",
      "What is your family’s cultural or ethnic background, and what traditions do you celebrate together?",
      "Are there any foods, songs, or stories from your culture that you love—what makes them special?",
      "Besides English, do you speak or understand any other languages? How do they sound when you say them?",
      "Do you have a favorite animal, color, or object that feels like “you”—what is it and why?",
      "If you had to choose a symbol (like a lion, a red balloon, or a star) to represent yourself, what would it be and what does it mean?"
    ],
    "follow_up_questions": [
      "What inspired you to say that?",
      "Why does that matter to you?",
      "How did you feel when that happened?",
      "What memories come up when you think of that?",
      "Which part of that stands out most in your mind?",
      "Can you describe it to me as if I’d never heard of it before?",
      "What do you notice about yourself when you remember that?",
      "If you could relive that moment, would you change anything? Why or why not?",
      "What questions pop into your head about that now?",
      "How would you explain this to one of your friends?",
      "What’s one little detail about this that nobody else knows?",
      "How has that shaped who you are today?",
      "If you had to show someone this with a drawing or gesture, what would it look like?",
      "What sights, sounds, or smells do you imagine when you think about it?",
      "What surprised you most about that experience?",
      "What lesson, if any, did you learn from it?",
      "How do you think this will matter to you in a year or ten years?",
      "What would you tell someone who’s never experienced that?",
      "What do you think other people feel about that?",
      "Is there anything else you’d like to add that I didn’t ask?"
    ]
  },
  "Living Environment": {
    "questions": [
      "Can you describe the country and region (state/province) where you live—what makes it special or different from other places?",
      "How would you explain your city, town, or village to someone who’s never been there—what sights or activities stand out?",
      "What type of home do you live in (house, apartment, mobile home, etc.), and what do you like most about it?",
      "Tell me about your bedroom and play area—what colors, decorations, or toys make it feel like yours?",
      "What’s the outdoor space around your home like (garden, backyard, nearby playground), and what do you enjoy doing there?",
      "Who are some of your neighbors—kids, pets, or grown-ups—and what games or adventures have you shared with them?",
      "What key landmarks (like a park, store, or school) are near your home, and why are they important or fun for you?",
      "When you step outside, what sounds or smells do you notice first—are there any you love or dislike?",
      "Can you share a memorable story about something you did in your neighborhood, like an adventure in the park or visiting a local shop?",
      "If you were giving someone a tour of your neighborhood, where would you start and what would you definitely show them first?"
    ],
    "follow_up_questions": [
      "What part of that place or detail makes you the happiest?",
      "When you picture it in your mind, what colors do you see?",
      "What do your friends or family say about it?",
      "How long does it take you to get there, and what do you notice along the way?",
      "Can you share a story that happened there?",
      "If that spot had its own soundtrack, what sounds or music would you hear?",
      "Which season (spring, summer, fall, winter) is your favorite there, and why?",
      "What would you miss most about it if you couldn’t visit anymore?",
      "If you could bring one special thing from home to that place, what would it be?",
      "Are there any unspoken rules or customs you follow when you’re there?",
      "If you had to draw a map of the area, which landmarks would you include?",
      "What’s something new you noticed the last time you were there?",
      "What’s the biggest challenge you face when you’re in that space?",
      "What time of day do you like being there best, and what makes it special?",
      "If this place could do one magical thing, what would it be?",
      "Who would you invite to join you there, and what would you do together?",
      "In a single sentence, how would you sum up that place?",
      "If that place or object had a voice, what would it say to you?",
      "What do you think someone who’s never been there would be surprised to learn?",
      "Is there anything else you’d like me to know about it?"
    ]
  },
  "Family & Close Relationships": {
    "questions": [
      "Who do you live with at home, and what are their names and jobs?",
      "Can you tell me about your brothers or sisters—how old are they and what’s it like when you play or argue together?",
      "Do you have any grandparents, cousins, or other family who visit or live nearby? What’s your favorite thing to do with them?",
      "What happens at mealtimes in your family—who cooks, where do you eat, and what do you talk about?",
      "How do you celebrate special days like birthdays or holidays—what traditions make those times memorable?",
      "What chores or responsibilities do you help with around the house, and how do you feel about doing them?",
      "How do your parents or guardians show they love you—through hugs, words, or other ways?",
      "If you do something wrong, how do your parents or guardians let you know, and what do they do next?",
      "When you feel sad, scared, or upset, who do you go to first, and what do they do to help you feel better?",
      "Can you share a story about a time your family came together to solve a problem or celebrate something important?"
    ],
    "follow_up_questions": [
      "What made you say that?",
      "How did that moment make you feel?",
      "Why is that important to you?",
      "Can you give me a specific example of when that happened?",
      "What do you notice most about how others react in that situation?",
      "How has that changed over time?",
      "What’s one detail about that you haven’t told me yet?",
      "If you could change anything about that, what would you do differently?",
      "How do you think someone else in your family would describe the same event?",
      "What’s the hardest part about that for you?",
      "What do you enjoy most about it?",
      "Who usually takes the lead, and why?",
      "How do you prepare for that activity or routine?",
      "What smells, sounds, or sights do you associate with it?",
      "How would you explain that to a friend who’s never experienced it?",
      "What lesson, if any, did you learn from it?",
      "How do you think it shapes who you are today?",
      "If you were writing it as a story, how would you start?",
      "When you look back in a year, what do you think you’ll remember most?",
      "Is there anything else about that you’d like to share?"
    ]
  },
  "Education & Learning": {
    "questions": [
      "What grade are you in, and what kind of school do you go to (public, private, homeschool, etc.)?",
      "How do you feel about your grade level—what’s exciting or tricky about being in your grade?",
      "Who is your favorite teacher, and what makes their class stand out?",
      "Can you tell me about a classmate you really enjoy working or playing with?",
      "What’s your daily commute like—how do you get to school, and what do you see or do along the way?",
      "What does a typical school day schedule look like for you from the first bell to the last?",
      "Which subject do you find easiest, and why does it come naturally to you?",
      "Which subject feels hardest, and what do you do when it gets challenging?",
      "How do you learn best—do you like seeing pictures, doing hands-on activities, listening to explanations, or something else?",
      "Do you participate in any clubs or lessons after school (like chess club, music lessons, or martial arts)? What do you enjoy about them?"
    ],
    "follow_up_questions": [
      "What made you say that?",
      "Can you give me an example of when that happened?",
      "How did you feel in that moment?",
      "Why is that important to you?",
      "What’s the most fun or the hardest part about it?",
      "How has that changed since you first started?",
      "What do others say about it—friends, teachers, or family?",
      "If you could do it again, what would you do differently?",
      "What sounds, sights, or smells do you remember around that time?",
      "How do you prepare for that day or activity?",
      "What’s one thing nobody else knows about that experience?",       
      "Which part stands out most in your mind?",       
      "How would you explain it to someone who’s never been there?",       
      "What would you tell a friend to help them get better at it?",       
      "What surprised you most about that?",       
      "What lesson did you learn from it?",       
      "How do you think it will matter to you next year?",       
      "If that subject or activity were a person, what would they be like?",       
      "What advice would you give to a younger kid about this?",       
      "Is there anything else you’d like to add that I didn't ask?"     
    ]
  },
  "Play & Recreation": {
    "questions": [
      "What’s your favorite toy to play with, and what makes it special to you?",
      "Which video game or app do you love the most, and what do you enjoy about it?",
      "If you could invent a brand-new game or toy, what would it be and how would you play with it?",
      "What sport or physical activity do you like to do the most, and why?",
      "Tell me about a time you played on a team or in a class (soccer, gymnastics, etc.)—what was that experience like?",
      "When you go outside to play freely (bike riding, tag, etc.), what’s your favorite thing to do?",
      "What’s the coolest drawing, painting, or craft you’ve made recently?",
      "Have you ever built something awesome with LEGO, blocks, or another engineering kit? What did you build?",
      "What’s your favorite pretend-play scenario or costume to dress up in, and what role do you play?",
      "If you could spend an entire day doing any play or creative activity, what would your perfect play day look like?"
    ],
    "follow_up_questions": [
      "What made you decide on that?",
      "How did you feel the first time you tried it?",
      "Can you walk me through your best memory with it?",
      "What’s the trickiest or most challenging part?",
      "How do your friends or family react when you play or create this?",
      "What sounds, sights, or textures do you notice when you’re doing it?",
      "If this toy or game could talk, what would it say to you?",
      "How would you describe it to someone who’s never seen or played it?",
      "What would you change to make it even more fun?",
      "What skills or muscles do you use when you play or build this?",
      "Who do you most like playing or creating with, and why?",
      "If you had to teach someone else how to do it, what steps would you show them?",
      "What’s one secret tip or strategy you use?",
      "What surprised you the most when you first did it?",
      "How has your approach or style changed over time?",
      "What’s one challenge you’ve overcome while playing or building it?",
      "What advice would you give to a younger kid trying this for the first time?",
      "If you could combine this with another game or craft, what would you mix together?",
      "How do you know when you’ve done it really well?",
      "Is there anything else about this that you’d like me to know?"
    ]
  },
  "Daily Routines & Habits": {
    "questions": [
      "What time do you usually wake up on school mornings, and what’s the first thing you do?",
      "What’s your go-to breakfast, and how does it make you feel for the rest of the morning?",
      "How do you pack your school bag—what items are absolutely must-haves?",
      "After you get home from school, what’s your favorite snack and where do you eat it?",
      "Can you walk me through your homework routine—where do you sit and how do you stay focused?",
      "Once your homework is done, what’s your favorite way to unwind or play?",
      "Describe your evening wind-down: what happens from dinner until you climb into bed?",
      "Do you have a special bedtime ritual (story, song, stuffed animal)? What makes it comforting?",
      "How much time do you spend on screens each day, and what do you usually watch or play?",
      "How does using screens or watching shows affect how you feel before bedtime or during the day?"
    ],
    "follow_up_questions": [
      "What made you choose that?",
      "How did you feel in that moment?",
      "Can you describe what you see, hear, or smell then?",
      "Why is that part your favorite (or least favorite)?",
      "How long have you been doing it that way?",
      "What’s the trickiest bit, and how do you handle it?",
      "Who usually helps you with this routine?",
      "If you could change one thing about it, what would it be?",
      "What memories pop up when you think about it?",
      "How do your family or friends react when they see you do this?",
      "What tools, toys, or apps do you rely on for this?",
      "Have you ever had a funny or surprising mishap during this?",
      "How does this routine shape the rest of your day?",
      "What advice would you give a friend who’s trying this for the first time?",
      "What’s one small detail about it that nobody else knows?",
      "How do you know when it’s time to move on to the next thing?",
      "What do you wish you did differently?",
      "If this routine were a story, how would you start it?",
      "When you look back in a year, what do you think you’ll remember most?",
      "Is there anything else about this part of your day you’d like to share?"
    ]
  },
  "Health & Nutrition": {
    "questions": [
      "What are your three favorite foods, and what makes them special?",
      "Is there a food you really dislike, and why don’t you like it?",
      "What usually happens at mealtimes in your house—who’s there, what do you talk about, and where do you eat?",
      "How do you feel when you try a completely new dish—excited, nervous, or something else?",
      "Can you remember a time recently when you realized you’d grown taller or stronger—what gave it away?",
      "What time do you usually go to sleep and wake up, and do you feel rested during the day?",
      "Have you ever had trouble sleeping—like waking up at night or having bad dreams? What is that like?",
      "Do you have any allergies or medical conditions—what should someone know about them and how do you manage them?",
      "What’s your tooth-brushing routine—when do you brush, for how long, and do you use a special toothpaste or song?",
      "How often do you wash your hands, and what reminds you to do it every time?"
    ],
    "follow_up_questions": [
      "Why do you think that is?",
      "How did that make you feel in the moment?",
      "What sounds, tastes, or textures do you remember most?",
      "What part of that experience was your favorite?",
      "Which part was the hardest or least fun?",
      "Can you show me or draw what that looks like?",  
      "How long did it take, and what did you do while you waited?",  
      "What advice would you give someone else about this?",  
      "What surprised you the most about it?",  
      "How did you prepare for that, if at all?",  
      "Who else was there, and what did they do?",  
      "If you could change one thing, what would it be?",  
      "How often does this happen in your day or week?",  
      "What do you think causes that feeling or reaction?",  
      "How has it changed since last year or last time?",  
      "What do you think you’ll remember about this later on?",  
      "What questions do you still have about it?",  
      "How do you think it helps or affects you?",  
      "How would you explain this to a younger kid?",  
      "Is there anything else about this you’d like to share?"
    ]
  },
  "Emotional & Psychological": {
    "questions": [
      "How would you describe your usual mood—what feeling do you wake up with most days?",
      "What emotion do you notice most often during the day—happy, excited, calm, worried, or something else?",
      "Can you tell me about a time when you felt really adventurous—what happened and how did it feel?",
      "When you start to feel upset or anxious, what’s the first thing you do to help yourself calm down?",
      "Describe a moment when you used drawing, talking to someone, or breathing exercises to feel better—what was that like?",
      "Do you have any special tricks or habits for when you’re stressed, like counting, squeezing a toy, or listening to music?",  
      "What’s your biggest fear—like the dark, tests, or being alone—and what do you do when that fear shows up?",  
      "What kinds of worries pop into your head, and how do they affect what you do or think?",  
      "What events or moments make you feel super excited or joyful, like birthdays, vacations, or special achievements?",  
      "Can you share a story about a time you were proud of something you did—how did that joy feel in your body?"  
    ],
    "follow_up_questions": [
      "What made you feel that way?",
      "Why was that important to you?",
      "How did your body react when that happened?",
      "Can you tell me more about what you were thinking at the time?",
      "Who did you turn to or talk to when you felt like that?",
      "What sounds, smells, or sights do you remember from that moment?",
      "If that feeling had a color or shape, what would it be?",
      "What did you learn from experiencing that?",
      "How often does that feeling or situation come up for you?",
      "What helps you move on after feeling like that?",
      "What would you say to a friend who’s going through the same thing?",
      "How has your response changed since the first time you felt it?",
      "What surprised you most about that experience?",
      "If you could go back, would you do anything differently? Why or why not?",  
      "How do you think that feeling affects other parts of your day?",  
      "What do others around you do when they see you feeling like that?",  
      "When you look back later, what do you think you’ll remember most?",  
      "If this were a story, how would you begin or end it?",  
      "What advice would you give your younger self about handling this?",  
      "Is there anything else you’d like to share that I didn’t ask?"  
    ]
  },
  "Social World & Peer Relationships": {
    "questions": [
      "Who is your best friend, and how did you two become buddies?",
      "What do you and your friends like to do together when you hang out?",
      "How do you decide who’s “in” your group at school or during playtime?",
      "Can you tell me about a time you felt left out of a game or clique? What happened?",
      "What do you do when you and a friend disagree or argue—how do you fix it?",
      "Have you ever seen someone being bullied? What did you do, or wish you had done?",
      "When someone else is upset with you, how do you make things right again?",
      "Who do you look up to—whether it’s a family member, celebrity, or story character—and why?",
      "What qualities in your role models do you admire most, and how do you try to be like them?",
      "If you could invite any hero (real or fictional) to spend a day at your school, who would it be and what would you ask them?"
    ],
    "follow_up_questions": [
      "What made you think of that?",
      "How did you feel at that moment?",
      "Why is that memory important to you?",
      "Can you give me a specific example of when that happened?",
      "How did the other person react?",
      "What did you learn from that experience?",
      "If you could do it over, what would you change?",
      "Who else was there and what did they do?",
      "What advice would you give a friend in the same situation?",
      "How did you prepare or get ready for that interaction?",
      "What surprised you most about what happened?",
      "How do you think the other person felt?",
      "How did that change your friendship afterward?",
      "When you look back, what detail stands out the most?",
      "How would you handle it differently next time?",
      "What qualities do you share with your hero?",
      "What advice do you think your role model would give you?",
      "How do you feel when you see your hero doing something great?",
      "What would you most want to ask your hero if they were here?",
      "Is there anything else about that moment or person you’d like to share?"
    ]
  },
  "Cognitive & Moral Development": {
    "questions": [
      "How do you usually figure out how to solve a problem—do you think it through step by step or just try things until something works?",
      "Can you tell me about a time you faced a tricky puzzle or task—what was your first move?",
      "When you get stuck on something, what do you do next—ask for help, try a different idea, or keep at it?",
      "How do you decide what’s fair when you’re sharing items or taking turns?",
      "If you found a lost toy on the playground, what would you do and why?",
      "What does “being honest” mean to you, and how do you know when you’re telling the truth?",
      "How do you think about time like “yesterday,” “today,” and “tomorrow”—what makes them different?",
      "What’s your plan for a typical day—from waking up to going to bed—and how do you keep track of it?",
      "Imagine you have two tasks—a quick one and a long one—which do you tackle first, and how do you decide?",
      "Tell me about a time you had to wait for something important—how did you know when it was your turn or when it would happen?"
    ],
    "follow_up_questions": [
      "Why did you decide to do it that way?",
      "What made you think of that idea first?",
      "How did you feel when you tried that?",
      "What was the trickiest part for you?",
      "Can you describe what you noticed around you at the time?",
      "Who did you talk to or get help from, if anyone?",
      "What would you try differently next time?",
      "What did you learn from that experience?",
      "How do you tell if something is fair or not?",
      "What clues help you know when something will happen?",
      "What surprised you most about how it turned out?",
      "How long did it take from the beginning to the end?",
      "If you were teaching a friend, what steps would you show them?",
      "What else were you thinking about while you worked on it?",
      "How would you explain this to someone who’s never done it before?",
      "What did you notice in your body when you felt that way?",
      "What happens next after that step?",
      "How do you keep track of what you need to do later?",
      "What could make this task more fun or easier?",
      "Is there anything else you’d like to share about that?"
    ]
  },
  "Digital & Media Environment": {
    "questions": [
      "What devices do you own or use most often (e.g., tablet, console, smartphone, computer)?",
      "How do you decide which device to use for different activities (games, homework, videos)?",
      "Where in your home do you usually use your devices, and what does that space look or feel like?",
      "On an average school day, how much time do you spend on screens before, during, and after homework?",
      "What’s your favorite TV show, movie, or YouTube channel right now, and what do you like about it?",
      "How do you find new shows, videos, or apps—do you search on your own, or does someone recommend them?",
      "What rules or limits do your parents or guardians set around screen time and online use?",
      "Have you ever encountered something online that made you uncomfortable or worried—what did you do?",
      "If you could design your own app or channel, what would it be called and what would it do?",
      "Who do you talk to if you have a question or problem while you’re online or using a device?"
    ],
    "follow_up_questions": [
      "What made you choose that device or app?",
      "Can you walk me through exactly how you start using it step by step?",
      "How do you feel when you’re watching or playing on that device?",
      "What do you notice first—the colors, sounds, or something else?",
      "Who else is usually around when you’re using it, and what do they do?",
      "What would you say to a friend who wanted to try it for the first time?",
      "What was surprising or unexpected about your experience?",
      "What’s the hardest part about using that device or app?",
      "How do you solve a problem if something freezes or doesn’t work?",
      "What settings or parental controls are in place, and how do they help you?",
      "How do your parents or guardians react if you break a screen-time rule?",
      "What do you do when you finish a video or level—do you switch right away or take a break?",
      "What time of day do you prefer using screens, and why?",
      "How does using screens affect what you do afterward—play, homework, sleep?",
      "If you could add one feature or change one thing, what would it be?",
      "How do you balance screen time with outdoor play or other activities?",
      "Have you ever shown someone else how to use an app or gadget—what did you teach them?",
      "What do you imagine is happening behind the scenes when the app loads or runs?",
      "How do you feel when you can’t use a device for a while?",
      "Is there anything else about your digital world or media habits you’d like to share?"
    ]
  },
  "Values, Beliefs & Worldview": {
    "questions": [
      "What family or religious traditions do you take part in, and what do they mean to you?",
      "Which holiday or celebration in your family is your favorite, and how do you celebrate it?",
      "How do the customs or rules your family follows—like saying prayers, cooking special foods, or wearing certain clothes—make you feel?",
      "What does being a good person mean to you, and how do you decide what’s right or wrong?",
      "Can you tell me about a time when you faced a hard choice—like whether to tell the truth or keep something private—and what you did?",
      "Which values do your parents or guardians emphasize (honesty, kindness, respect, etc.), and how do you practice them?",
      "How do you feel when you think about nature or the environment—what makes you care about trees, animals, or the Earth?",
      "Do you have any pets or favorite animals, and what have they taught you about responsibility or compassion?",
      "What kind of world or future do you imagine when you grow up—what’s most important to you about that future?",
      "If you could change one thing about how people treat each other or the planet, what would you change and why?"
    ],
    "follow_up_questions": [
      "Why is that tradition or custom meaningful to you?",
      "What sights, sounds, or smells do you associate with that celebration?",
      "How has your view of it changed as you’ve gotten older?",
      "What questions do you still have about why your family follows that practice?",
      "Can you share a specific story about that tradition in action?",
      "What were the hardest and easiest parts of making that choice?",
      "How did others react when you chose one way over another?",
      "What did you learn about yourself from that experience?",
      "Who else in your life models these values, and how do they show it?",
      "How do you remind yourself to act on those values every day?",
      "What role do animals or nature play in your favorite activities?",
      "How would you explain to a friend why it’s important to protect the environment?",
      "If you could send one message to everyone about caring for the planet, what would it be?",
      "What worries you most about the future of animals, nature, or the Earth?",
      "What gives you hope when you think about tomorrow’s world?",
      "How do you show kindness or respect in your everyday actions?",
      "What’s one small thing you’ve done recently to help someone or something?",
      "How would you teach a younger sibling or friend about these beliefs?",
      "How do you think your values might change as you get older?",
      "Is there anything else about your beliefs, hopes, or traditions you’d like to share?"
    ]
  },
  "Dreams, Goals & Aspirations": {
    "questions": [
      "What’s one thing you’d really love to have or do in the next week—like a new toy, a trip, or an activity?",
      "If you could wish for one special surprise tomorrow, what would it be and why?",
      "What’s a goal you’re working on this month—maybe learning something new or finishing a project?",
      "When you think about growing up, what job or career do you dream of having, and what makes it exciting?",
      "If you could invent anything to make life better or more fun, what would you create and how would it work?",
      "Is there a place or country you’d love to visit someday—what would you do there first?",
      "What’s one big thing you hope to accomplish before your next birthday?",
      "How do you picture yourself ten years from now—what are you doing and who are you with?",
      "What qualities or skills do you like most about yourself, and what’s one thing you’d like to get even better at?",
      "If you could be the “ideal” version of you for a day, what would you change or enhance about yourself?"
    ],
    "follow_up_questions": [
      "Why did you choose that wish or goal?",
      "What would make that surprise extra special?",
      "How will you know when you’ve achieved it?",
      "What’s the first step you’d take to make it happen?",
      "Who could help you reach that goal, and how?",
      "What challenges might you face, and how would you handle them?",
      "How would you celebrate once you’ve done it?",
      "What do you imagine seeing, hearing, or feeling when it happens?",
      "How does it compare to other wishes or dreams you’ve had?",
      "What inspires you about that job, invention, or place?",
      "If you had unlimited resources, how would your answer change?",
      "How does this dream reflect what matters most to you?",
      "What skills or habits will you need to develop?",
      "Can you picture a day in the life of that future you—what happens?",
      "What’s one thing you can do today to move closer?",
      "Who in your life shares a similar dream, and what can you learn from them?",
      "How might this goal change the way you feel about yourself?",
      "What worries you about working toward it, and how can you ease that worry?",
      "If someone else asked you for advice on this, what would you tell them?",
      "Is there anything else about your dreams or goals you’d like to share?"
    ]
  },
  "Personal Safety & Well-being": {
    "questions": [
      "What are some things around your home or playground that you know can be dangerous, and how do you stay safe from them?",
      "How do you decide if it’s okay to go somewhere outside—like crossing the street or playing near a road?",
      "What would you do if a stranger you didn’t know tried to talk to you or give you something?",
      "How do you let someone know you don’t want to be touched or hugged—what do you say or do?",
      "Who are the grown-ups you feel safest telling “no” to, and how did you learn they’re trustworthy?",
      "If you ever got hurt or saw someone else get hurt, how would you know when and how to call for help?",
      "Can you tell me step-by-step what you would do if you fell and scraped your knee?",
      "What supplies (like band-aids or ice packs) do you keep at home for small injuries, and where are they?",
      "When you feel upset or scared, how do you let people know you need help or a break?",
      "What rules or tips have your parents, teachers, or coaches given you about staying safe in unexpected situations?"
    ],
    "follow_up_questions": [
      "What made you think of that?",
      "Can you walk me through exactly what you’d do first?",
      "How did you feel when that happened (or when you imagined it)?",
      "Why is that rule or tip important to you?",
      "What sounds, sights, or smells do you notice in that situation?",
      "Who else would be around, and what would they do?",
      "If you could change one thing to make it safer, what would it be?",
      "What questions do you still have about handling that?",
      "How did you learn that rule—who taught it to you?",
      "What’s one mistake someone might make, and how would you correct it?",
      "How long do you think it takes to get help in that scenario?",
      "What supplies do you wish you had if it got worse?",
      "How would you stay calm while you wait for help?",
      "Who would you trust most to support you, and why?",
      "What would you say to a friend who didn’t believe it could be dangerous?",
      "How has your approach changed since you first learned about it?",
      "What surprises you about how other kids handle the same situation?",
      "What’s the hardest part about doing that the right way?",
      "If you taught a younger kid, what key steps would you show them?",
      "Is there anything else about staying safe that you think is important?"
    ]
  },
  "Financial & Civic Responsibility": {
    "questions": [
      "How do you earn money or allowance—what chores, tasks, or occasions give you coins or dollars?",
      "When you get money, what do you usually choose to spend it on first, and why?",
      "Can you tell me about something you really wanted and saved up for—what steps did you take?",
      "What rules or habits does your family have about sharing, saving, or spending money?",
      "Describe a time you decided to spend your money versus save it—what helped you decide?",
      "Have you ever given money, toys, or time to help someone else—what did you do and how did it feel?",  
      "What volunteer work or community service have you done—like helping at a food drive or cleaning up a park?",
      "Are there any local events or neighborhood projects you’ve helped organize or take part in? Tell me about one.",
      "How do you and your family practice recycling, composting, or conserving water and electricity at home?",
      "Can you share a story of exploring nature—like a hike or beach cleanup—and how you helped protect it?"
    ],
    "follow_up_questions": [
      "What inspired you to make that choice?",
      "Why was that important to you?",
      "How did you feel when you first tried it?",
      "What steps did you follow, exactly?",
      "Who helped or joined you, if anyone?",
      "What challenges did you face along the way?",
      "How did you decide on your goal or plan?",
      "What surprised you most about the outcome?",
      "How long did it take from start to finish?",
      "What did you learn from doing that?",
      "How did others react when they saw you do it?",
      "If you could do it again, what would you change?",
      "What sounds, sights, or smells do you remember?",
      "How do you track your progress or savings?",
      "What advice would you give a friend trying the same thing?",
      "How has your approach changed since last time?",
      "What tools or supplies did you need?",
      "How did you stay motivated when it got hard?",
      "What does success look like for you in this?",
      "Is there anything else about this experience you’d like to share?"
    ]
  }
}
